[
  {
    "id": "1jyx979",
    "title": "Increasing number of websites blocking VPNs",
    "author": "hopenoonefindsthis",
    "permalink": "https://old.reddit.com/r/VPN/comments/1jyx979/increasing_number_of_websites_blocking_vpns/",
    "content": "Don't be abusive. No commercial/affiliate links. No irrelevant personal sites. Use your service's official support channel. Be vendor neutral. Link to subs, not specific posts. Back up your claims with proof. Read Reddit's Reddiquette, Rules, and FAQ. Do not ask for any recommendations for VPN services. ​Posts with recommendations will be removed Failure to follow the above may result in banning or post removal without warning. New accounts are temporarily moderated. All moderated posts are manually reviewed and if on topic should be approved with in 24 hours of posting. The spam filter can get a little overzealous sometimes. If you make a post and then can't find it, it's probably there. Please message the moderators and we'll review it.",
    "comments": [
      {
        "author": "Harmony_Mabel",
        "content": "A lot of sites have started aggressively blocking known VPN IPs, even when geo-blocking isn't an issue. It’s probably tied to bot/spam prevention. Some VPNs rotate IPs more frequently or offer residential proxies, which can help. Split tunneling or using a custom DNS might also get around it in some cases."
      },
      {
        "author": "Confident-Pop-9256",
        "content": "What VPNs offer residential proxies?"
      },
      {
        "author": "coastalMountain",
        "content": "I have noticed the same and shifted my router setup to use more of an DNS masking/unblocking solution than a VPN based one."
      },
      {
        "author": "krush_groove",
        "content": "Can you please share a site or video that I explains what this is and how to do it?"
      },
      {
        "author": "coastalMountain",
        "content": "I have been using Privacy Hero 2 for a few months now and love the unblocking flexibility. You can watch it here: https://www.youtube.com/watch?v=sPmfTkvD4J0&themeRefresh=1"
      },
      {
        "author": "witceojonn",
        "content": "Yes this is a constant problem we run into and have been working very diligently to solve. Especially with the ad-blocking nature of our service it’s an added layer of difficulty."
      },
      {
        "author": "Much-Definition-6176",
        "content": "I’m yet to find a VPN that works fine on the internet. Blockers are advancing faster than VPN technology. Soon VPN’s will be illegal too. In my country Australia our prime minister made it so only 16 year olds can use social media. Sounds good right ? No. You now have to enter your government iD to use any social media and they have made it so if they catch you using a VPN over the age of 16 or not, you could face prison time"
      },
      {
        "author": "01011011001",
        "content": "Prison for using a VPN? How do Australians connect to their work networks when working from home?"
      },
      {
        "author": "ConsiderYourFood",
        "content": "Just like everyone else. That person doesn’t know what they are talking about."
      },
      {
        "author": "Pleasant-Shallot-707",
        "content": "Confusing “using a VPN to perform unauthorized acts” with “using a VPN”"
      },
      {
        "author": "Zealousideal_Brush59",
        "content": "And how will they connect when they're working from prison?"
      },
      {
        "author": "Pleasant-Shallot-707",
        "content": "I doubt the simple use of a vpn is the cause for criminal charges"
      },
      {
        "author": "ConsiderYourFood",
        "content": "This is not true. There are no social media restrictions yet, and even when they start, there will be no penalties for underage users who access an age-restricted social media platform — the penalties are for the companies who allow people to use platforms when underage. There are also no restrictions on using VPNs in Australia."
      },
      {
        "author": "Pleasant-Shallot-707",
        "content": "[deleted]"
      },
      {
        "author": "Pleasant-Shallot-707",
        "content": "They’re spreading misinformation"
      },
      {
        "author": "dasanman69",
        "content": "Soon VPN’s will be illegal too. That's not going to happen. There are still plenty of people who use one for legitimate reasons."
      },
      {
        "author": "Hold-Administrative",
        "content": "None of that is actually true"
      },
      {
        "author": "Much-Definition-6176",
        "content": "Maybe prison time is exaggerated. But by December 2025 when the law takes effect if you are using a VPN while on any social media your account will be banned and reported to the authorities."
      },
      {
        "author": "hcornea",
        "content": "“Prison time” is a complete fiction that you made up."
      },
      {
        "author": "TenorSax11_11",
        "content": "What... Are you sure you are not in China?"
      }
    ],
    "thread_title": "Increasing number of websites blocking VPNs",
    "thread_url": "https://old.reddit.com/r/VPN/comments/1jyx979/increasing_number_of_websites_blocking_vpns/",
    "username": "hopenoonefindsthis",
    "timestamp": "2025-05-14",
    "scrape_time": "2025-05-14T13:05:02.446631"
  },
  {
    "id": "1kanmml",
    "title": "Even pauze van het scrollen? Trakteer jezelf op iets lekkers. Van hamburger tot pizza en fried chicken: je lievelingsgerechten staan klaar in de Uber Eats app. 📲🍔🍕 Waarom moeilijk doen als het ook lekker kan? Eerst iets lekkers. Lekker Uber Eats.",
    "author": "ubereats",
    "permalink": "https://alb.reddit.com/cr?za=vhxN0xFExjbbO49ojWHEMR_GcalhsB5EXmTzQ0aOOOZqAznF4Eue4LTnCO86TmWFDtEHzXru7zR5hU1MD_Zaydr5uiMzCqh7ihrWhyItjCGOq-1-LZTUi5UmN4JBWDS_VsBx5Agqi1pNnR0C9MXAohzqpWkxzUT0OAtLSHP318msQ109opVvVRWwLMkNhkULSy0fjzCpQHF0ANov11e072ag-7TaUQxREjMhJfKnL26Tq-FAOGm7VEF6uZT7EKK1T2-TIkD00VwADkIvhXYWY08-7pmWDo2X19tWReRS1W-6LgH30D_1jI-5h8Sm0w7fHjqVmqMESzknCH4bTaOxqkCaWJ6l7ItZ5EmVRPmTEqJE-v90Umr9dBAXX6yaeHDwafjiffarfrrY2tQwSZsblD7yTk7szoUmuqVDtmYR2KXpBqgwVVt6oWob_ZB9fiIB_1I4BWkeK75buX3QC8j6OQToZ8gZQrY7ap4MnydMe_BdHDCEhhrdTe_yAe5ltfQGNfIHf_1l2BE0Yeqgv1LfMmw5lCVzrCz582RDQMtJScueIWOSQO0&zp=W0LV-Qi2NI2r3iFoNEtXQR3C81dHksrvaOJISyIQ9lEOMt_RkkYCTNGmsvFfSi0AGK-Syywb6QRvXyFRAE9-TWTXe4LDpfiWpGTYtQfg8U5gNusRKGlK9ijxS0IfDquSA4Ci7iSwxkBTSRSx4u2BYxuHSRGi9Rxd2zXcol7BRY6LNdPjPggIa4wBiVmpgqq6H5xMDM1eOQJrYt9mgSV7UFCjPTYSu75bdutYA96RmKuBplJcXYkjnhwEizhUfIHoCKNtBQLPoRnVsCBrPMdu1D6nVsMGY0pAr1sU98zYdyd_85Pp_KMR02bvShuwgKk3pvVuiM0qKWFlt6TPUsgqtdN41ckgCrHFvf2KiKvrSvoyXoih2hf9YmwQChgjyVaOaPn4w1rcZ7HwzmGWcZE6a2VXquqLw7lrUu5635hsSAd8rsMbansAJkaDY4CxKiUNys0jA0iUNdD6l1aODc2bK7IpXd7CFn0VGFykFyu2lSE1YFEYag",
    "content": "",
    "comments": [],
    "thread_title": "Even pauze van het scrollen? Trakteer jezelf op iets lekkers. Van hamburger tot pizza en fried chicken: je lievelingsgerechten staan klaar in de Uber Eats app. 📲🍔🍕 Waarom moeilijk doen als het ook lekker kan? Eerst iets lekkers. Lekker Uber Eats.",
    "thread_url": "https://alb.reddit.com/cr?za=vhxN0xFExjbbO49ojWHEMR_GcalhsB5EXmTzQ0aOOOZqAznF4Eue4LTnCO86TmWFDtEHzXru7zR5hU1MD_Zaydr5uiMzCqh7ihrWhyItjCGOq-1-LZTUi5UmN4JBWDS_VsBx5Agqi1pNnR0C9MXAohzqpWkxzUT0OAtLSHP318msQ109opVvVRWwLMkNhkULSy0fjzCpQHF0ANov11e072ag-7TaUQxREjMhJfKnL26Tq-FAOGm7VEF6uZT7EKK1T2-TIkD00VwADkIvhXYWY08-7pmWDo2X19tWReRS1W-6LgH30D_1jI-5h8Sm0w7fHjqVmqMESzknCH4bTaOxqkCaWJ6l7ItZ5EmVRPmTEqJE-v90Umr9dBAXX6yaeHDwafjiffarfrrY2tQwSZsblD7yTk7szoUmuqVDtmYR2KXpBqgwVVt6oWob_ZB9fiIB_1I4BWkeK75buX3QC8j6OQToZ8gZQrY7ap4MnydMe_BdHDCEhhrdTe_yAe5ltfQGNfIHf_1l2BE0Yeqgv1LfMmw5lCVzrCz582RDQMtJScueIWOSQO0&zp=W0LV-Qi2NI2r3iFoNEtXQR3C81dHksrvaOJISyIQ9lEOMt_RkkYCTNGmsvFfSi0AGK-Syywb6QRvXyFRAE9-TWTXe4LDpfiWpGTYtQfg8U5gNusRKGlK9ijxS0IfDquSA4Ci7iSwxkBTSRSx4u2BYxuHSRGi9Rxd2zXcol7BRY6LNdPjPggIa4wBiVmpgqq6H5xMDM1eOQJrYt9mgSV7UFCjPTYSu75bdutYA96RmKuBplJcXYkjnhwEizhUfIHoCKNtBQLPoRnVsCBrPMdu1D6nVsMGY0pAr1sU98zYdyd_85Pp_KMR02bvShuwgKk3pvVuiM0qKWFlt6TPUsgqtdN41ckgCrHFvf2KiKvrSvoyXoih2hf9YmwQChgjyVaOaPn4w1rcZ7HwzmGWcZE6a2VXquqLw7lrUu5635hsSAd8rsMbansAJkaDY4CxKiUNys0jA0iUNdD6l1aODc2bK7IpXd7CFn0VGFykFyu2lSE1YFEYag",
    "username": "ubereats",
    "timestamp": "2025-05-14",
    "scrape_time": "2025-05-14T13:05:13.030787"
  },
  {
    "id": "1k6snu4",
    "title": "Can employer see browsing activity on personal computer when I’m using their VPN?",
    "author": "kmilvin",
    "permalink": "https://old.reddit.com/r/VPN/comments/1k6snu4/can_employer_see_browsing_activity_on_personal/",
    "content": "Don't be abusive. No commercial/affiliate links. No irrelevant personal sites. Use your service's official support channel. Be vendor neutral. Link to subs, not specific posts. Back up your claims with proof. Read Reddit's Reddiquette, Rules, and FAQ. Do not ask for any recommendations for VPN services. ​Posts with recommendations will be removed Failure to follow the above may result in banning or post removal without warning. New accounts are temporarily moderated. All moderated posts are manually reviewed and if on topic should be approved with in 24 hours of posting. The spam filter can get a little overzealous sometimes. If you make a post and then can't find it, it's probably there. Please message the moderators and we'll review it.",
    "comments": [
      {
        "author": "SpinJail",
        "content": "If you are connected to their VPN, yes. They can see browsing activity."
      },
      {
        "author": "kmilvin",
        "content": "Even if I’m using my home WiFi, and not browsing the web using the VPN? Sorry to sound dense, I just don’t understand the HOW of it? Lime I could see if I’m browsing from my work computer, but I’m closing out that window and on my personal computer, not connecting through their VPN. And they can see THAT activity?!"
      },
      {
        "author": "SpinJail",
        "content": "I'm sorry? You changed the question. Is the VPN on your personal computer or not? If so, then yes... they can see what you're browsing (as long as the VPN is on/running). It doesn't matter if you close the remote viewer client because you're still connected to the VPN on your personal computer. There is zero correlation to the remote client here. If your personal PC has the VPN connected, they can see. It doesn't matter if you've minimized the remote work window or not. Once you flip the VPN off, then they can no longer see what you browse."
      },
      {
        "author": "kmilvin",
        "content": "Ah, ok. Good to know. Thanks so much!"
      },
      {
        "author": "FoxYolk",
        "content": "it's possible they have monitoring software that doesnt route traffic so if ur doing something private still be wary"
      },
      {
        "author": "Livid-Setting4093",
        "content": "As an IT of an employer like that - we really don't want to have your personal activity going through our network so it's set up with split tunnel - your connection to Internet goes directly out and doesn't concern us."
      },
      {
        "author": "SP3NGL3R",
        "content": "https://whatismyipaddress.com/ Check that with and without the VPN active. If it changes, 100% of your activity is going through the office VPN. If it doesn't then likely only office related stuff is going thru the VPN. However they can change that at any time with the VPN settings, so. Be wary. Also the DNS calls may still be 100% VPN while actual traffic isn't. This lets them see where you're going but not what you're doing there (like a shared location, you know where your friend is but not what they're doing there)"
      },
      {
        "author": "kmilvin",
        "content": "Very helpful! Thanks, I’ll try this!"
      },
      {
        "author": "backafterdeleting",
        "content": "Also important: If they had you import a company SSL certificate into your browser, it could also be possible to read the content of the pages you visit. Normally they would only see the domain name (e.g. google.com) and the amount of data, but the rest would be encrypted. But adding the SSL cert would mean they can decrypt that too. In theory they could even read your bank transactions if you logged into online banking etc. Whether they actually make the effort to do this would probably depend on legal restrictions and the company."
      },
      {
        "author": "kmilvin",
        "content": "That makes sense, thanks for that insight."
      },
      {
        "author": "unknown2hinson",
        "content": "VPN is about network communications, not about programs and activity on your computer. If you open application on your computer like calculator, they would never know. if you open an app that checks for updates, then your company's IT team will be able to see that your computer went the application update website. If your VPN is off they can't see anything. If your VPN is on, they can see your network/internet communications."
      },
      {
        "author": "DeveloperBRdotnet",
        "content": "If you vpn is down they will not see. Depending on the VPN it will route all traffic to the VPN, which means everything that you access is visible"
      },
      {
        "author": "ColoRadBro69",
        "content": "Even if I’m using my home WiFi, and not browsing the web using the VPN? If the VPN is running, all internet traffic goes through it. Your computer considers a VPN to be the safe way to use the Internet so when it's available, everything goes through it. That's a technical detail that's not obvious and probably not common knowledge."
      },
      {
        "author": "Microflunkie",
        "content": "It depends on how your work has configured their VPN settings. But the most likely answer is that they can see what websites you visit while you are connected to the VPN but probably not the details of what you viewed on a given website. VPN connections can be configured to either route ALL traffic through them or just specific traffic destined for internal company resources. There is no reliable means of guessing which your company utilizes without someone knowledgeable examining your VPN configuration and even then it may not be immediately clear. In either case it IS extremely common for work VPN connections to supply the work DNS servers as the main DNS for your PC to use. This is so that internal work resources, such as servers or workstations, can be identified and accessed using domain names such as yourPC.Company.local instead of a raw IP address such as 192.168.11.113. This also means that any DNS query while connected to the work VPN will be answered by the work DNS servers which will therefore know that you visited Amazon, Gmail and porn server XYZ. The work servers likely do not know what you searched for on Amazon or if you actually purchased anything or not, they also wouldn’t know what your emails said or even if you read any of them and finally they wouldn’t know what category of porn you looked at. There are implementations where the work servers could see more details of your activity but that would require more invasive changes to your PC which is far less likely to be done to employee personal computers even when used to telecommute. It is also possible that the work VPN does NOT provide DNS and only routes work related traffic to the VPN but this is also pretty unlikely. The only safe assumption on your part is that your work can and does know everything you do while connected to their VPN. This way you are either correct or just overly cautious."
      },
      {
        "author": "kmilvin",
        "content": "Wow, thank you for this! Exactly the information I was after. And I lol’ed at the porn category comment! Thanks so much!"
      },
      {
        "author": "NotMuch2",
        "content": "If the sites are https (not http), then they could only see the IP address you're connecting to. The full path and content are encrypted"
      },
      {
        "author": "InvisoSniperX",
        "content": "FYI, Corporate VPNs may also require management profiles that include a company web-proxy certificate that can decrypt your HTTPs traffic. That management profile and web-proxy may be active regardless of your VPN connection status. In-general it's best to have separate devices."
      },
      {
        "author": "unknown2hinson",
        "content": "Not necessarily true. Modern Layer7 Firewalls have the ability to do Cert Inspection, which terminates the encryption, inspects the contents, then re-encrypts using the organization's certificates. The personal device would show a certificate warning, stating that there has been a break in the chain of trust in the certificate. If the person pays attention and doesn't proceed all is well, but a lot of people just ignore it and proceed anyway. As for logging of the IP, it also shows the domain, URL, Headers, and applies the info to application category (adult, hacking, guns, collaboration, AI, health, etc) - this may be an issue enough for some (like me) who want privacy and separation of personal vs work."
      },
      {
        "author": "kmilvin",
        "content": "So they can see all of that activity on my personal computer, using my home WiFi? Not connecting through their VPN?"
      },
      {
        "author": "NotMuch2",
        "content": "If not using their VPN, then no. Also, connecting to their VPN still uses your home Internet/ wifi"
      }
    ],
    "thread_title": "Can employer see browsing activity on personal computer when I’m using their VPN?",
    "thread_url": "https://old.reddit.com/r/VPN/comments/1k6snu4/can_employer_see_browsing_activity_on_personal/",
    "username": "kmilvin",
    "timestamp": "2025-05-14",
    "scrape_time": "2025-05-14T13:05:25.425107"
  },
  {
    "id": "1keyxjy",
    "title": "Hiding location from my job",
    "author": "ImpressiveWriting489",
    "permalink": "https://old.reddit.com/r/VPN/comments/1keyxjy/hiding_location_from_my_job/",
    "content": "Don't be abusive. No commercial/affiliate links. No irrelevant personal sites. Use your service's official support channel. Be vendor neutral. Link to subs, not specific posts. Back up your claims with proof. Read Reddit's Reddiquette, Rules, and FAQ. Do not ask for any recommendations for VPN services. ​Posts with recommendations will be removed Failure to follow the above may result in banning or post removal without warning. New accounts are temporarily moderated. All moderated posts are manually reviewed and if on topic should be approved with in 24 hours of posting. The spam filter can get a little overzealous sometimes. If you make a post and then can't find it, it's probably there. Please message the moderators and we'll review it.",
    "comments": [
      {
        "author": "HomomorphicTendency",
        "content": "If you are a US government contractor and work on export controlled tech you will be committing a serious crime. Just letting you know in case."
      },
      {
        "author": "peesoutside",
        "content": "Yes, regulated industries dont tolerate that."
      },
      {
        "author": "Zarathz",
        "content": "could u elaborate about this? thanks"
      },
      {
        "author": "Alphadice",
        "content": "Government contracts have clauses that the work has to be done in the US to prevent outsourcing. The idea of remote work hasn't made it into the knowledge base of the people in charge yet."
      },
      {
        "author": "smokingcrater",
        "content": "It isn't for outsourcing, lots of gov work is already outsourced. Certain data and controls can't leave US soil. (Even some things like certain encryption algorithms.) Other countries have laws that might be incompatible."
      },
      {
        "author": "zzmgck",
        "content": "Not just US government contracts. If you work with any export controlled technology, you are going to have problems."
      },
      {
        "author": "k7eric",
        "content": "And when you add in the DoD you also get the benefit of the US only applying to CONUS and not including Hawaii, Alaski, Puerto Rico or any territories. Immediately fired offense to connect to CONUS systems outside of the continental US without a filing cabinets worth of restrictions, permission and forms."
      },
      {
        "author": "kirksan",
        "content": "Networking guy here. If the organization you work for has any compliance issues that would prevent working from outside of the US then you will be caught."
      },
      {
        "author": "ImpressiveWriting489",
        "content": "Hey! I work for an eyeglass company, doing customer service. I asked HR for the remote policy, nothing is said about anything regarding travel, just maintaining work load. I appreciate you"
      },
      {
        "author": "kirksan",
        "content": "No worries. I just didn’t want you to get fired."
      },
      {
        "author": "aphaelion",
        "content": "Honest question then: What are you trying to accomplish? You sound simultaneously (a) worried that they'll \"find out\" and (b) confident that it's fine and they wouldn't mind."
      },
      {
        "author": "ImpressiveWriting489",
        "content": "Definitely not confident. That’s why I’m asking."
      },
      {
        "author": "aphaelion",
        "content": "Well then I think the spirit of what /u/kirksan said still stands. A lot of companies have major concerns with out-of-country work. Not necessarily of the \"we-have-a-stick-up-our-butt-and-want-to-ruin-your-fun\" variety, but \"we have regulatory stuff that we have to adhere to, so we hire employees only from certain countries to stay compliant\". I'm not familiar with your field (eyeglasses), but it doesn't seem unreasonable that some info you touch might fall under something like this. (e.g. do you ever see/touch eye prescription information? That could easily be HIPAA info. Do you ever see payment or account info from the people who call in?) And that's not necessarily something that you'd find spelled out in a remote work doc from HR - might be in some fine-print you signed when you got hired. But the fact that this post title uses the word \"hide... from my job\" hints you already know that on some level. Up to you to do the research and find out, but I wouldn't count on \"... but the doc about remote work didn't specifically say I had to be in this country\" as a defense HR will care about, if something ever leaks outside your VPN."
      },
      {
        "author": "saltedjello",
        "content": "But...no offense...it's customer service. So I say take the risk and live your best life! The worst that can happen is they find out and fire you. Use a VPN and don't post pictures of you surfing in Mexico on your social media. Seriously, get off that crap! My HR looks through people's socials and have fired them for being where they werent supposed to, or being \"super sick\" yet skiing in Colorado."
      },
      {
        "author": "aphaelion",
        "content": "But...no offense...it's customer service. So I say take the risk and live your best life! That's a perfectly valid approach. My post wasn't taking a stand on the morality or ethics of it. It was an effort to help OP avoid unpleasant surprises. The original question was \"how do I hide this from my employer?\". When told \"hey that might not be a good idea\", OP replied \"but I read the remote-work doc from HR\". Like fine, glad you read that doc but if you value your job (as implied by OP trying to hide it in the first place), just be warned that having read that doc will do zero to protect you. To put it another way, what's the point of reading that doc in the first place if your determined to disregard or ignore the company's rules anyway? Just go for it."
      },
      {
        "author": "maxinvalla",
        "content": "The other concern could be taxes. You are generating income in a foreign country and you may need to file there. Also depending on the number of employees the company may have to file in that country. While the chances of being caught are very slim, it is a very good reason to not allow you to work outside the country regardless of the policy. You always have to file your taxes properly regardless of what your employee manual says."
      },
      {
        "author": "DaBears1228",
        "content": "HIPAA info?"
      },
      {
        "author": "thewunderbar",
        "content": "If you have to ask this, it is likely that you're violating a company policy by doing so. Is it worth risking your job over?"
      },
      {
        "author": "rlap38",
        "content": "My company uses GPS on their devices so a VPN doesn’t help. And yes, some of what we work on is subject to export controls."
      },
      {
        "author": "Mitch_Ohio",
        "content": "You can spoof a GPS. (On Android)"
      }
    ],
    "thread_title": "Hiding location from my job",
    "thread_url": "https://old.reddit.com/r/VPN/comments/1keyxjy/hiding_location_from_my_job/",
    "username": "ImpressiveWriting489",
    "timestamp": "2025-05-14",
    "scrape_time": "2025-05-14T13:05:33.366568"
  },
  {
    "id": "1kiws2t",
    "title": "Do you use your VPN 24/7? Why or why not?",
    "author": "VintageLV",
    "permalink": "https://old.reddit.com/r/VPN/comments/1kiws2t/do_you_use_your_vpn_247_why_or_why_not/",
    "content": "Don't be abusive. No commercial/affiliate links. No irrelevant personal sites. Use your service's official support channel. Be vendor neutral. Link to subs, not specific posts. Back up your claims with proof. Read Reddit's Reddiquette, Rules, and FAQ. Do not ask for any recommendations for VPN services. ​Posts with recommendations will be removed Failure to follow the above may result in banning or post removal without warning. New accounts are temporarily moderated. All moderated posts are manually reviewed and if on topic should be approved with in 24 hours of posting. The spam filter can get a little overzealous sometimes. If you make a post and then can't find it, it's probably there. Please message the moderators and we'll review it.",
    "comments": [
      {
        "author": "PossibilityAnxious81",
        "content": "I leave mine on most of the time. Mainly cause I don’t think about it and it doesn’t cause me many issues. But lately more and more services are recognizing IP addresses associated with a vpn and blocking them. So I’ve had to manually turn them off more. If it keeps happening I’ll probably just start leaving it off."
      },
      {
        "author": "IcyBubbles1",
        "content": "yes"
      },
      {
        "author": "Alex-PsyD",
        "content": "Same"
      },
      {
        "author": "twistedbluepickle",
        "content": "Yes"
      },
      {
        "author": "Cathbeck",
        "content": "95% of the time yes."
      },
      {
        "author": "AppropriateSilver378",
        "content": "Nope, I only use it when I need it to access specific content. Some services will not work with the VPN connection active."
      },
      {
        "author": "AUG3980",
        "content": "Yes. Because everything is blocked in my country"
      },
      {
        "author": "tiffto1103",
        "content": "same!"
      },
      {
        "author": "TourLegitimate4824",
        "content": "25/8 !!!! Always on"
      },
      {
        "author": "Poozipper",
        "content": "I have to turn change my VPN to the united states for HBO max."
      },
      {
        "author": "Bilbo2317",
        "content": "I don't even turn on location services."
      },
      {
        "author": "Ok-Duck-1100",
        "content": "I started few days ago buying a VPN and using it 24/7. Reasons are the following: 1) Generally speaking, it enhances your security masking your IP and, even if you stay in safe websites, it’s like having a shield in the pocket just in case 2) It ensure privacy and anonymity if you need to torrent (since certain countries have strong anti piracy laws) 3) Since you are located in a part of the world, you Internet Service Provider (ISP) might block certain websites: in that case you use the VPN to unlock those websites I use 24/7 because since you have unlimited VPN for the time you paid for, it makes sense to always use it. It’s like an insurance: have a margin of safety!"
      },
      {
        "author": "billdietrich1",
        "content": "Yes, because if I keep turning it on and off, at some point I will forget to have it on when I really want it to be on."
      },
      {
        "author": "Kuchenkaempfer",
        "content": "No. it's a nice privacy plus, but I'm lazy and https encryption is pretty decent on its own. There are 100x more ways to track someone by things other than their ip, so unless you're using hardened firefox it's useless anyways."
      },
      {
        "author": "VintageLV",
        "content": "Can you elaborate? I know about browser fingerprinting, but that's just *one* more way. What are the others?"
      },
      {
        "author": "XOKP",
        "content": "Actually, browser fingerprinting isn’t just “one more way”, it’s more like an umbrella term covering a bunch of different methods websites use to identify you without relying on your IP address."
      },
      {
        "author": "Noah2570",
        "content": "standing outside their window with a spyglass 🤷🏻‍♂️"
      },
      {
        "author": "Kuchenkaempfer",
        "content": "cookies, as for browser fingerprinting, it's pretty much impossible to avoid."
      },
      {
        "author": "abrasiveteapot",
        "content": "so unless you're using hardened firefox it's useless anyways. Why doesn't everyone ? I keep a separate browser for the, like 3, use cases that librewolf breaks and I actually want enough to use degoogled chromium instead"
      },
      {
        "author": "Just-Steak-9966",
        "content": "Mine is always on, but I only route 3 apps through it. Everything else bypasses it."
      }
    ],
    "thread_title": "Do you use your VPN 24/7? Why or why not?",
    "thread_url": "https://old.reddit.com/r/VPN/comments/1kiws2t/do_you_use_your_vpn_247_why_or_why_not/",
    "username": "VintageLV",
    "timestamp": "2025-05-14",
    "scrape_time": "2025-05-14T13:05:46.079315"
  },
  {
    "id": "1kircpj",
    "title": "Why do I have to turn it off to access sites?",
    "author": "Mission-Dance-5911",
    "permalink": "https://old.reddit.com/r/VPN/comments/1kircpj/why_do_i_have_to_turn_it_off_to_access_sites/",
    "content": "Don't be abusive. No commercial/affiliate links. No irrelevant personal sites. Use your service's official support channel. Be vendor neutral. Link to subs, not specific posts. Back up your claims with proof. Read Reddit's Reddiquette, Rules, and FAQ. Do not ask for any recommendations for VPN services. ​Posts with recommendations will be removed Failure to follow the above may result in banning or post removal without warning. New accounts are temporarily moderated. All moderated posts are manually reviewed and if on topic should be approved with in 24 hours of posting. The spam filter can get a little overzealous sometimes. If you make a post and then can't find it, it's probably there. Please message the moderators and we'll review it.",
    "comments": [
      {
        "author": "nricotorres",
        "content": "Some sites block common VPN IPs, it's just how it is. I don't know what country you're in or the VPN you paid for, but if 60% of your sites are blocking the VPN, that's not at all common. I have maybe a dozen that block it..."
      },
      {
        "author": "Steven8909",
        "content": "[deleted]"
      },
      {
        "author": "Steven8909",
        "content": "This. It's far easier to detect and block your VPN than it is to detect and block threat actors activity who are also utilizing VPNs."
      },
      {
        "author": "Mission-Dance-5911",
        "content": "Ok, I definitely understand that. But, if you have to turn it off frequently, why have one? It happens several times a day, and I question whether I’ll use one in the future. I used to be fairly savvy with tech stuff, but I’ve definitely got left behind. Even basic stuff like this is confusing me. lol"
      },
      {
        "author": "klausklass",
        "content": "Why use a VPN anyway if you are able to access the site without it? The privacy benefits are marginal at best"
      },
      {
        "author": "hcornea",
        "content": "Especially on a store, where you’ve signed in, logged your purchase and entered your delivery address!!"
      },
      {
        "author": "Mission-Dance-5911",
        "content": "Yeah, good point. 😂"
      },
      {
        "author": "Astazha",
        "content": "It still provides privacy from your ISP and from anyone on your wifi or LAN."
      },
      {
        "author": "hcornea",
        "content": "Given that most websites are https:, the only privacy relates to tracking which URLs you visit. People apparently overestimate how interesting they are."
      },
      {
        "author": "Many_Ad_7678",
        "content": "Which one are you using?"
      },
      {
        "author": "hcornea",
        "content": "Perhaps try using a different server in your VPN’s settings. That will give you a different apparent IP address and may not be blocked."
      },
      {
        "author": "forreddituse2",
        "content": "Because most websites want to confirm you are a human being, not a bot to crawl their data or to abuse their discount programs. Do a simple Google search, you will find tons of tutorials/3rd party service for webmasters to block VPN/public proxy/TOR IP."
      },
      {
        "author": "updatelee",
        "content": "Many sites, me included, block vpns. It significantly helped lower script kiddies probing our site, especially free or low cost vpns. Same with free / cheap vps (no vps needs to access our commerce site after all)"
      },
      {
        "author": "ajkewl245a",
        "content": "I use an inexpensive VPN, but I get blocked at a lot of sites. I was thinking about setting up my own VPN host on a VPS, but you're saying that those might be blocked as well? Are you getting lists of IP addresses for VPSs and blocking those ranges?"
      },
      {
        "author": "updatelee",
        "content": "That's exactly what I do, basically the thought is this. My business caters to residential users, we sell shirts, shorts, hats etc. So why would hezner be viewing my page? They wouldn't ... unless someone is using one of their vps as a vpn. So yup, crowdsec supplies lists of known free vpns and proxies as well as lists of known vps like hezner, digital ocean, etc Crowdsec makes it very easy to add block lists to your waf and just never have to worry about all that noise generated by script kiddies and security probers Basically you need to think about why you need a vpn at all. The why will help you with the how"
      },
      {
        "author": "frenchtea1",
        "content": "Does getting a static IP from one of the main providers work? Since it would be used by only me? Or do sites block arrays of similar IPs? Edit removed typo as per following comment)"
      },
      {
        "author": "Accurate_Chair_3443",
        "content": "They typically block ip ranges/subnets of vpn providers. I'd imagine this includes static ips since vpns typically don't regulate or log user activity."
      },
      {
        "author": "Many_Ad_7678",
        "content": "What is con?"
      },
      {
        "author": "frenchtea1",
        "content": "Typo, will edit ;)"
      },
      {
        "author": "ferriematthew",
        "content": "I only just got it working so I haven't really tested it but if you use a VPN to tunnel back to your home IP I think there's a smaller chance you'll get blocked"
      }
    ],
    "thread_title": "Why do I have to turn it off to access sites?",
    "thread_url": "https://old.reddit.com/r/VPN/comments/1kircpj/why_do_i_have_to_turn_it_off_to_access_sites/",
    "username": "Mission-Dance-5911",
    "timestamp": "2025-05-14",
    "scrape_time": "2025-05-14T13:05:54.448681"
  },
  {
    "id": "1k6aqok",
    "title": "Google always ends up finding my real ip address...",
    "author": "JokerStarxD",
    "permalink": "https://old.reddit.com/r/VPN/comments/1k6aqok/google_always_ends_up_finding_my_real_ip_address/",
    "content": "Don't be abusive. No commercial/affiliate links. No irrelevant personal sites. Use your service's official support channel. Be vendor neutral. Link to subs, not specific posts. Back up your claims with proof. Read Reddit's Reddiquette, Rules, and FAQ. Do not ask for any recommendations for VPN services. ​Posts with recommendations will be removed Failure to follow the above may result in banning or post removal without warning. New accounts are temporarily moderated. All moderated posts are manually reviewed and if on topic should be approved with in 24 hours of posting. The spam filter can get a little overzealous sometimes. If you make a post and then can't find it, it's probably there. Please message the moderators and we'll review it.",
    "comments": [
      {
        "author": "dragonb2992",
        "content": "What about other websites that show your IP? I'm wondering if somehow Bluestacks isn't using the VPN at all?"
      },
      {
        "author": "JokerStarxD",
        "content": "the whole machine is on proxy, all website show my proxy IP, but google somehow finds it right away"
      },
      {
        "author": "JokerStarxD",
        "content": "[removed]"
      },
      {
        "author": "JokerStarxD",
        "content": "The bluestacks instances are fresh and brand new.."
      },
      {
        "author": "TheMaddis",
        "content": "Thae 3 things can help: Good luck"
      },
      {
        "author": "JokerStarxD",
        "content": "How can I combine dedicated proxy with a VPN? My internet seems not to work anymore when I do so ( DNS conflict type shi )"
      },
      {
        "author": "TheMaddis",
        "content": "College proxy will do this. It routs your proxy connection through the VPN protocol"
      },
      {
        "author": "Puzzled_Monk_1394",
        "content": "Obviously the proxy is leaking. You should be able to find a VPN server that isn't blacklisted. I use a VPN on a daily basis, I rarely run into issues, but I do sometimes have to change servers."
      },
      {
        "author": "JokerStarxD",
        "content": "The default ISP of nvpn is flagged everywhere !"
      },
      {
        "author": "Puzzled_Monk_1394",
        "content": "Maybe try a different VPN service? Or are you saying that your ISP blocks VPN's?"
      },
      {
        "author": "JokerStarxD",
        "content": "I'll try to find another VPN. thanks"
      },
      {
        "author": "forreddituse2",
        "content": "Do you use the same Google account on your (physical) cellphone now?"
      },
      {
        "author": "JokerStarxD",
        "content": "No all accounts are fresh and never used on any physical device, only blue stacks"
      },
      {
        "author": "deedledeedledav",
        "content": "Try using an incognito window and see if you get the same thing"
      },
      {
        "author": "JokerStarxD",
        "content": "sometime that fixes it, but in blue stacks it doesn't.."
      },
      {
        "author": "MaybeAnInventor",
        "content": "As far as I know, Android doesn't run all traffic through the VPN if a VPN is turned on. It's coded that way in the Kernel level"
      }
    ],
    "thread_title": "Google always ends up finding my real ip address...",
    "thread_url": "https://old.reddit.com/r/VPN/comments/1k6aqok/google_always_ends_up_finding_my_real_ip_address/",
    "username": "JokerStarxD",
    "timestamp": "2025-05-14",
    "scrape_time": "2025-05-14T13:06:06.886462"
  },
  {
    "id": "1khag1p",
    "title": "Youtube Premium",
    "author": "MistressStarrr",
    "permalink": "https://old.reddit.com/r/VPN/comments/1khag1p/youtube_premium/",
    "content": "Don't be abusive. No commercial/affiliate links. No irrelevant personal sites. Use your service's official support channel. Be vendor neutral. Link to subs, not specific posts. Back up your claims with proof. Read Reddit's Reddiquette, Rules, and FAQ. Do not ask for any recommendations for VPN services. ​Posts with recommendations will be removed Failure to follow the above may result in banning or post removal without warning. New accounts are temporarily moderated. All moderated posts are manually reviewed and if on topic should be approved with in 24 hours of posting. The spam filter can get a little overzealous sometimes. If you make a post and then can't find it, it's probably there. Please message the moderators and we'll review it.",
    "comments": [
      {
        "author": "cruz878",
        "content": "I threw in the towel on geo arbitrage months ago. Brave Browser on iOS and Firefox +ublock on Windows. An added benfit is I have reduced my Youtube viewing by like 80% as I mainly watched via Roku for years."
      },
      {
        "author": "Perfect_Cost_8847",
        "content": "The fact of the matter is 99% of my YouTube viewing was mindless brain rot content. 1% was useful tutorial type stuff. After their 40% price hike recently I cancelled Premium. It took an adjustment but now I’m watching good quality shows and movies instead of mindless talking heads raging about nonsense. I’m sure there are people out there who can use YouTube (and TikTok) responsibly, but I am not one of them."
      },
      {
        "author": "frenchtea1",
        "content": "Honest question, but why are yous paying for YouTube premium when you can watch it on a computer without adds for free with an add blocker? Is it because you want to look at it on your phone instead?"
      },
      {
        "author": "Perfect_Cost_8847",
        "content": "Yes, and on the TV with an Apple TV. Premium offers things on iPhone like offline downloads, no ads, and background playback. They really make it a horrible experience on mobile unless you subscribe."
      },
      {
        "author": "frenchtea1",
        "content": "Ah makes sense thanks 😊"
      },
      {
        "author": "Reddit2metbh",
        "content": "I mainly use mine at work so I can lock my phone and play the audio from videos etc, I switched to YouTube music from Spotify too and feel it’s a better deal overall for ad free YouTube and music. I tried brave etc for like a year but just didn’t like it as much as the YouTube app itself"
      },
      {
        "author": "cruz878",
        "content": "For me I watched it almost exclusively on my TVs (roku) prior to lossing premium. But as perfect_cost said it was mostly useless garbage I was also watching so am mostly happy it died as I would rather not watch at all then watch with ads."
      },
      {
        "author": "cruz878",
        "content": "I couldn't agree more with this statement. I have been watching better Television and Movies now vs most of my TV time had been spent in youtube useless rabbit holes."
      },
      {
        "author": "OkCompute5378",
        "content": "Problem is no access to enhanced bitrate without premium on PC"
      },
      {
        "author": "thereal-evilmouse",
        "content": "Just got this email too, not again, only been 4 months on premium since the last time"
      },
      {
        "author": "MistressStarrr",
        "content": "Damn I am so sorry :/...I have a friend in the Philippines I am wondering if I should have them pay for it and I should just reimburse them."
      },
      {
        "author": "thereal-evilmouse",
        "content": "If you do, look at getting a family account, I’m sure others will be part of it"
      },
      {
        "author": "aflices88",
        "content": "I am also interested in doing a family account, DM me, same email just came."
      },
      {
        "author": "reddave88",
        "content": "And me"
      },
      {
        "author": "ChickenMcRibs",
        "content": "I am pretty sure YouTube allows you to only add people in the same country to family account"
      },
      {
        "author": "Okkehh",
        "content": "Funny thing is, they think a person who used vpn to pay for premium will be like “oh well, I guess I better pay these cnts 22$ /month since they cancelled my plan” to watch click bait junk and low effort reactions lmao"
      },
      {
        "author": "McKnighty9",
        "content": "I mean… most will."
      },
      {
        "author": "Minimum_Airline3657",
        "content": "Use a vpn and change your location to Albania, no adverts"
      },
      {
        "author": "Lobsta1986",
        "content": "Use the app outertune YouTube music free essentially. Best if luck."
      },
      {
        "author": "shn6",
        "content": "Depends on your platform, but if you're on PC you could just get Firefox + ublock origin. For Android there's ReVanced, NewPipe, Outertune, etc. There's Brave browser for ios / macos"
      }
    ],
    "thread_title": "Youtube Premium",
    "thread_url": "https://old.reddit.com/r/VPN/comments/1khag1p/youtube_premium/",
    "username": "MistressStarrr",
    "timestamp": "2025-05-14",
    "scrape_time": "2025-05-14T13:06:15.443381"
  },
  {
    "id": "1kkyp0m",
    "title": "Guidance on VPN",
    "author": "Reasonable_Type_9300",
    "permalink": "https://old.reddit.com/r/VPN/comments/1kkyp0m/guidance_on_vpn/",
    "content": "Don't be abusive. No commercial/affiliate links. No irrelevant personal sites. Use your service's official support channel. Be vendor neutral. Link to subs, not specific posts. Back up your claims with proof. Read Reddit's Reddiquette, Rules, and FAQ. Do not ask for any recommendations for VPN services. ​Posts with recommendations will be removed Failure to follow the above may result in banning or post removal without warning. New accounts are temporarily moderated. All moderated posts are manually reviewed and if on topic should be approved with in 24 hours of posting. The spam filter can get a little overzealous sometimes. If you make a post and then can't find it, it's probably there. Please message the moderators and we'll review it.",
    "comments": [
      {
        "author": "RespectNarrow450",
        "content": "Use a remote desktop or VPN to route your VA’s access through your location, keeping logins consistent. Limit permissions and use 2FA to maintain control and security."
      },
      {
        "author": "Reasonable_Type_9300",
        "content": "I’ve looked at some vpns online with location services but it’s not clear if it’s included or one sided? What is a 2FA?"
      },
      {
        "author": "RespectNarrow450",
        "content": "Two-Factor Authentication (2FA): For extra layer of security.. Even with someone else logging in, you'll get notified or need to approve access, helping maintain control over your accounts. Hope this helps"
      },
      {
        "author": "djrbx",
        "content": "I’ve looked at some vpns online with location services but it’s not clear if it’s included or one sided? If it's not already clear, the only way to do what you want to accomplish is to host your own VPN server. You do not want to pay for a VPN service and use their servers. What you want is the data to be originating from your location. The best way to do that is to deploy your own VPN at home."
      },
      {
        "author": "primeTimeTea",
        "content": "interesting, why don't you just deploy a home vpn server for them? something like https://keephomeip.co or r/tailscale"
      },
      {
        "author": "Reasonable_Type_9300",
        "content": "I think this would be more expensive and I’m not familiar with keephomeip and would rather not send them a device"
      },
      {
        "author": "primeTimeTea",
        "content": "you don't need to send them a device. buy a home server only and have them connect to it"
      },
      {
        "author": "djrbx",
        "content": "A raspberry pi with docker installed running the wg-easy container is all they need. Or to make it even more simple, a GLiNet Brume 2 VPN Gateway. It's cheaper than keephomeip and OP could use the built in wireguard server or the tailscale integration."
      },
      {
        "author": "primeTimeTea",
        "content": "yes but you are assuming they are technical enough"
      },
      {
        "author": "djrbx",
        "content": "This is true. I assumed so because the first few words in OPs post is I’m in tech... However, upon reading OPs responses, I do not think they are actually in tech themselves, they may just work for a tech company. Especially after reading that OP doesn't even know that 2FA is, OP is out of their depth and will probably be fired if OP does pursue this. Any competent IT admin can easily find out what OP is doing if not done properly."
      },
      {
        "author": "reddit_user_53",
        "content": "Yeah OP asking \"Whats a 2FA\" was alarming. I don't think this plan is gonna work"
      },
      {
        "author": "prfsvugi",
        "content": "Be prepared to be fired when your company finds out"
      },
      {
        "author": "djrbx",
        "content": "I made a comment here for some solutions Ethics aside and since I'm assuming you're going to be offloading your work behind your employers back, I do not recommend only relying on a VPN connection. Since this will probably be unsanctioned, my recommendation would be to buy a dedicated machine, even a mini PC, that the \"contractor\" would connect to and work of that machine. This way, all work that will be done will be coming from your device that you have physical access to. Your employer will not know that a VPN is being used as all connections will be coming from your home from this machine. The VPN is only required to access the machine and technically, you wouldn't even need a VPN as you could easily install software such as parsec to give access to the machine. The reason why I recommend doing it this way is because VPNs can sometimes fail. All it takes is a blip in connectivity and unless the VPN on the client side is configured correctly, logs will show that a connection was made across the globe. By forcing the \"contractor\" to only do work using a machine at your physical address, there will be no way that your employer will know that someone else is doing your work from across the globe. If the VPN for some reason fails, all that happens is the \"contractor\" will lose connection to the machine which means the work cannot be done. In your case, consider this a failsafe rather than a problem. Keep in mind, this is a highly fireable offense. You'll be granting access to company data to someone who is not an employee. I do not recommend this, especially since you said you're in tech but don't have the basic knowledge of how VPNs work or what 2FA is, which is very concerning. As I said in another reply, if done improperly, any competent IT admin will be notified of what you are doing and it will get your fired."
      },
      {
        "author": "AdhesiveTeflon1",
        "content": "Private VPNs into company systems...tsk tsk. Once that EDR alert goes off and an audit happens, you'll be in a much worse space."
      }
    ],
    "thread_title": "Guidance on VPN",
    "thread_url": "https://old.reddit.com/r/VPN/comments/1kkyp0m/guidance_on_vpn/",
    "username": "Reasonable_Type_9300",
    "timestamp": "2025-05-14",
    "scrape_time": "2025-05-14T13:06:29.122682"
  },
  {
    "id": "1kgmmhw",
    "title": "How do I know if my location is hidden when two IP addresses emerge?",
    "author": "ayitsjosh",
    "permalink": "https://old.reddit.com/r/VPN/comments/1kgmmhw/how_do_i_know_if_my_location_is_hidden_when_two/",
    "content": "Don't be abusive. No commercial/affiliate links. No irrelevant personal sites. Use your service's official support channel. Be vendor neutral. Link to subs, not specific posts. Back up your claims with proof. Read Reddit's Reddiquette, Rules, and FAQ. Do not ask for any recommendations for VPN services. ​Posts with recommendations will be removed Failure to follow the above may result in banning or post removal without warning. New accounts are temporarily moderated. All moderated posts are manually reviewed and if on topic should be approved with in 24 hours of posting. The spam filter can get a little overzealous sometimes. If you make a post and then can't find it, it's probably there. Please message the moderators and we'll review it.",
    "comments": [
      {
        "author": "tiffto1103",
        "content": "When you see two IP addresse, it means your work computer is likely connecting to both the internet through your VPN (giving you the VPN IP address) and company's security/monitoring servers directly (giving you the cybersecurity company IP). This is actually common in corporate environments - it's called a \"split tunnel\" configuration. What this means for hiding your location: Your VPN might be hiding your general internet traffic, but the cybersecurity software is likely still reporting your actual location back to your company through its direct connection. Think of it like wearing a disguise to a party, but your friend who knows your real identity is standing right next to you the whole time, occasionally calling you by your real name. If your company really wants to know where you are, that second connection is probably giving them that information, regardless of your VPN setup."
      },
      {
        "author": "fearSpeltBackwards",
        "content": "To be more thorough. The VPN has to be able to use the Internet connection through the ISP to build the VPN connection. Therefore, it will know what the actual IP address is of the ISP it is using. There is literally no way to stop this. However, as a Starlink user in central Illinois my POP can change from Chicago, O'Fallon, Columbus, Cincinnati and Grand Rapids all from home. In that case the obfuscation of which POP I come out of never truly reveal my true location. BTW, I only know of this problem because Fubo constantly has problems with the POP changing and then all our local channels change. They've gotten better at it, but it was pretty rampant when we first moved to Starlink. If the OP wants to avoid their company knowing where they truly are then Starlink is a viable alternative. We have been using Starlink since 2021. Both of us work from home, in IT and VPN into our corresponding networks with zero problems. I also have the Starlink Mini and use it for work/streaming on the road. If corporate were to ask me why my POP is in Hawaii, I could claim ignorance since my POP does often change even when I'm stationary in central Illinois. In addition, the public records for IP whois lookups are not accurate and for Starlink completely unreliable. I know folks stationed in Nairobi who have a POP in Minnesota and Winnipeg which is just not probable. Maybe possible with laser links between satellites but surely the Middle East would be more plausible than North America. I guess the moral of the story is Starlink provides a level of ambiguity of where the actual user is, the POP being a regional POP and not a local ISP and obfuscates true location in addition to inaccurate whois records that Starlink doesn't bother to update in a timely manner (or at all)."
      },
      {
        "author": "crrodriguez",
        "content": "You don't want your intenrnet traffic routed through the VPN of your company, you want that link to reach only and exclusively certain domain names or ip addresses on the company network or systems. FIx your routing and DNS to ensure that is the case."
      }
    ],
    "thread_title": "How do I know if my location is hidden when two IP addresses emerge?",
    "thread_url": "https://old.reddit.com/r/VPN/comments/1kgmmhw/how_do_i_know_if_my_location_is_hidden_when_two/",
    "username": "ayitsjosh",
    "timestamp": "2025-05-14",
    "scrape_time": "2025-05-14T13:06:39.887857"
  },
  {
    "id": "1keavjo",
    "title": "Help Vpn servers not connecting",
    "author": "Confident-Eye7786",
    "permalink": "https://old.reddit.com/r/VPN/comments/1keavjo/help_vpn_servers_not_connecting/",
    "content": "Don't be abusive. No commercial/affiliate links. No irrelevant personal sites. Use your service's official support channel. Be vendor neutral. Link to subs, not specific posts. Back up your claims with proof. Read Reddit's Reddiquette, Rules, and FAQ. Do not ask for any recommendations for VPN services. ​Posts with recommendations will be removed Failure to follow the above may result in banning or post removal without warning. New accounts are temporarily moderated. All moderated posts are manually reviewed and if on topic should be approved with in 24 hours of posting. The spam filter can get a little overzealous sometimes. If you make a post and then can't find it, it's probably there. Please message the moderators and we'll review it.",
    "comments": [
      {
        "author": "PlasticCarbon",
        "content": "Put a support ticket on their website."
      },
      {
        "author": "MaybeAnInventor",
        "content": "If a lot of them don't work, does Your country ban VPNs? (Russia, Egypt,..) Edit: Looked up Your profile and searched for what I suppose is Your country: https://www.msn.com/en-gb/crime/general/myanmar-enforces-new-cybersecurity-law-and-vpn-usage-is-the-main-target/ar-AA1wVp67 I don't know if You want to have it in the open that You try to use a VPN, Your government seems to crack down on it and even arrest people for using it :/"
      },
      {
        "author": "Confident-Eye7786",
        "content": "Everyone uses VPNs openly even people from the government, it's just an excuse to lock up dissidents and extort money from normal folks. My problem is that the ones that work are the more sketchier ones, I've encountered many people whose social media(the banned ones) accounts are being hacked, and even myself where my passwords were included in data breaches."
      },
      {
        "author": "MaybeAnInventor",
        "content": "It is possible that they banned all VPNs that aren't sketchy :/"
      },
      {
        "author": "Jayden_Ha",
        "content": "Since your government ban VPN, your best bet is to use Tor"
      },
      {
        "author": "Confident-Eye7786",
        "content": "Yeah I guess that's one of the last options"
      }
    ],
    "thread_title": "Help Vpn servers not connecting",
    "thread_url": "https://old.reddit.com/r/VPN/comments/1keavjo/help_vpn_servers_not_connecting/",
    "username": "Confident-Eye7786",
    "timestamp": "2025-05-14",
    "scrape_time": "2025-05-14T13:06:54.769973"
  },
  {
    "id": "1jls0g2",
    "title": "Is hardlopen écht slecht voor je knieën? Check alle fabels en feiten over hardlopen en kom ook in beweging.",
    "author": "nn_nederland",
    "permalink": "https://alb.reddit.com/cr?za=iIuMwbfpDxUfDCZHII8ECzo-ztGB1ilkbksQyh-Akx4IB-QeUZjPytN21308MKHD5FGBSJB2Qr8oncE4-P_UliKJ3sYaDQmEGX9jFxlLYcWdlxpGeGM2WXUerHqpttWhEBTRlLw84rR4LtZn5f7qBQX6mfHqTTjOZbZE8bO3x0bgGrHGLWSM9rwM9_NGlRZDNfmL_uok2WRbomnOrB6spPxHwIKaMVuGBVGYwokjbDdWq418W07GiqdYETz7K_UkI200hAxMzrH1T7ieT3uTN1Fc4_Ch3ykSk_ghoP34HmeiTVqjvemkYElx6JoqQKyb95iPwZHW_aBd0N1L74vg6gzt6XmUcKmZPF0KEj4FK_7kEST-sg9yzoNmowifxvxgTkya17Z3r-zfotrQouKj9oSt1lcT68RAuCy6IXI1ZVjgXNkaOwBRUNeIfWI4P58_0E-WlK8t3TtoiPN__VNuXzw-HaCR6UW7UCk-HM2AtZN6Su9qqccQcDInnMuDARvWq8gblNSSSg5je3hWhBA3V9Wa-TT0t5_66ib5xQHADly-VQHNGyNWMe8&zp=8kbGc-GSgKsKWFnpKZ2Sv1z20-CsS2c6bGzL6GpUHX_E_d30V1VDXKvIwcBcS3oK9sQ-iArSZ-JdZxxg7M5GsAFkMXwugR8UXjbk4rYYSOIVFnlEZTckjpVehOr1tP-2KAh2g0rk7pkqSDGNDGjNpjvIxhsPCBVq_9so5-L2qrQ5UQoHphESTcUz0Vpe4S7c0xUWSjgkzafQ3m2eGtRjkJKK9GJQlk89eNSOrc5UjRkomNAxSMhD-zUH1HnD889XGNKckOn76Q6PAP5VOpAp_Jk6fe3rgFO1ejX7KU1bZGi4oZ5RkRPEmffyz0seC7hnuZMS4KlSM1IDBS-3DjuCJ9Jtl69IEgmvK45Y402HRRAlb6d7-VH9XV0H_8cEC-I2dH21BQDycrQzXOCsWrGpznExGggduCTYfcJVCeIE3QVJeR9K9nyxOzBqrzE7dd6UakngXYKImSUscwtrVi2HE9EPB3z6COHGKWhnH4YR9xJPfs0tv3fJ-ePel__P25Jn_uAKr_0",
    "content": "",
    "comments": [],
    "thread_title": "Is hardlopen écht slecht voor je knieën? Check alle fabels en feiten over hardlopen en kom ook in beweging.",
    "thread_url": "https://alb.reddit.com/cr?za=iIuMwbfpDxUfDCZHII8ECzo-ztGB1ilkbksQyh-Akx4IB-QeUZjPytN21308MKHD5FGBSJB2Qr8oncE4-P_UliKJ3sYaDQmEGX9jFxlLYcWdlxpGeGM2WXUerHqpttWhEBTRlLw84rR4LtZn5f7qBQX6mfHqTTjOZbZE8bO3x0bgGrHGLWSM9rwM9_NGlRZDNfmL_uok2WRbomnOrB6spPxHwIKaMVuGBVGYwokjbDdWq418W07GiqdYETz7K_UkI200hAxMzrH1T7ieT3uTN1Fc4_Ch3ykSk_ghoP34HmeiTVqjvemkYElx6JoqQKyb95iPwZHW_aBd0N1L74vg6gzt6XmUcKmZPF0KEj4FK_7kEST-sg9yzoNmowifxvxgTkya17Z3r-zfotrQouKj9oSt1lcT68RAuCy6IXI1ZVjgXNkaOwBRUNeIfWI4P58_0E-WlK8t3TtoiPN__VNuXzw-HaCR6UW7UCk-HM2AtZN6Su9qqccQcDInnMuDARvWq8gblNSSSg5je3hWhBA3V9Wa-TT0t5_66ib5xQHADly-VQHNGyNWMe8&zp=8kbGc-GSgKsKWFnpKZ2Sv1z20-CsS2c6bGzL6GpUHX_E_d30V1VDXKvIwcBcS3oK9sQ-iArSZ-JdZxxg7M5GsAFkMXwugR8UXjbk4rYYSOIVFnlEZTckjpVehOr1tP-2KAh2g0rk7pkqSDGNDGjNpjvIxhsPCBVq_9so5-L2qrQ5UQoHphESTcUz0Vpe4S7c0xUWSjgkzafQ3m2eGtRjkJKK9GJQlk89eNSOrc5UjRkomNAxSMhD-zUH1HnD889XGNKckOn76Q6PAP5VOpAp_Jk6fe3rgFO1ejX7KU1bZGi4oZ5RkRPEmffyz0seC7hnuZMS4KlSM1IDBS-3DjuCJ9Jtl69IEgmvK45Y402HRRAlb6d7-VH9XV0H_8cEC-I2dH21BQDycrQzXOCsWrGpznExGggduCTYfcJVCeIE3QVJeR9K9nyxOzBqrzE7dd6UakngXYKImSUscwtrVi2HE9EPB3z6COHGKWhnH4YR9xJPfs0tv3fJ-ePel__P25Jn_uAKr_0",
    "username": "nn_nederland",
    "timestamp": "2025-05-14",
    "scrape_time": "2025-05-14T13:07:03.924362"
  },
  {
    "id": "1kapnxm",
    "title": "Considering a Travel Router to Stay Connected to My Home Network While Abroad",
    "author": "mitchconnersSP",
    "permalink": "https://old.reddit.com/r/VPN/comments/1kapnxm/considering_a_travel_router_to_stay_connected_to/",
    "content": "Don't be abusive. No commercial/affiliate links. No irrelevant personal sites. Use your service's official support channel. Be vendor neutral. Link to subs, not specific posts. Back up your claims with proof. Read Reddit's Reddiquette, Rules, and FAQ. Do not ask for any recommendations for VPN services. ​Posts with recommendations will be removed Failure to follow the above may result in banning or post removal without warning. New accounts are temporarily moderated. All moderated posts are manually reviewed and if on topic should be approved with in 24 hours of posting. The spam filter can get a little overzealous sometimes. If you make a post and then can't find it, it's probably there. Please message the moderators and we'll review it.",
    "comments": [
      {
        "author": "Bulky_Somewhere_6082",
        "content": "There's more to it. The normal VPN setup that most people use involve the VPN providers servers so you would not be on your home network. If you need to be on your home network then you will need a VPN server on your home network that you connect to. There are additional steps that must be done too."
      },
      {
        "author": "Feendster",
        "content": "I use a MT3000 with a client configuration via Open VPN. I have a No IP DDNS mapped to my home router in the event my home IP changes. Puts me on my home LAN."
      },
      {
        "author": "InvisoSniperX",
        "content": "I'm assuming you know all the compliance issues with this and accept that risk. Anyways here's what you're going to want to consider: * A low-end box at home or a cheap VPS to run your own VPN server. * If using a home server, you should use a DynamicDNS solution incase the Internet address changes * If you plan to visit a restrictive Internet location be aware not all VPNs would work * A travel router that supports that VPN * Ideally it also has a fail-secure configuration so it doesn't accidentally leak traffic if the VPN goes down * Be aware some Wifi points or locations (cruise ships) will either block or confiscate router looking devices * Disable location services on your work machine, otherwise it could report back via MDM solution All of these could be moot depending on the security posture of your company, but they should lessen the red-flags that you might trip."
      },
      {
        "author": "berlingoqcc",
        "content": "Yeah I have the similar router and use zerotier network to connect my home network with local router and route the traffic throw this network to access the internet via home. I have a small server running on rpi at home that does the connection"
      },
      {
        "author": "sffunfun",
        "content": "check out all the posts in /r/digitalnomad on how to set all this up"
      },
      {
        "author": "primeTimeTea",
        "content": "have you looked into https://keephomeip.co ?"
      }
    ],
    "thread_title": "Considering a Travel Router to Stay Connected to My Home Network While Abroad",
    "thread_url": "https://old.reddit.com/r/VPN/comments/1kapnxm/considering_a_travel_router_to_stay_connected_to/",
    "username": "mitchconnersSP",
    "timestamp": "2025-05-14",
    "scrape_time": "2025-05-14T13:07:14.128184"
  },
  {
    "id": "1k7b0o4",
    "title": "Can I use VPN when I upload YouTube vids?",
    "author": "mylittlekitty06",
    "permalink": "https://old.reddit.com/r/VPN/comments/1k7b0o4/can_i_use_vpn_when_i_upload_youtube_vids/",
    "content": "Don't be abusive. No commercial/affiliate links. No irrelevant personal sites. Use your service's official support channel. Be vendor neutral. Link to subs, not specific posts. Back up your claims with proof. Read Reddit's Reddiquette, Rules, and FAQ. Do not ask for any recommendations for VPN services. ​Posts with recommendations will be removed Failure to follow the above may result in banning or post removal without warning. New accounts are temporarily moderated. All moderated posts are manually reviewed and if on topic should be approved with in 24 hours of posting. The spam filter can get a little overzealous sometimes. If you make a post and then can't find it, it's probably there. Please message the moderators and we'll review it.",
    "comments": [
      {
        "author": "Cool_Survey_8732",
        "content": "Yes, you can use a VPN to upload videos and connect to a server in an English-speaking country. Also, set your video’s language and region to target those countries, and use relevant keywords in your title and tags. Promoting your videos on social media can help too."
      },
      {
        "author": "Bhavi_Fawn",
        "content": "Yes, you can use a VPN when uploading to YouTube, but it doesn’t directly change who sees your videos. YouTube mostly uses viewer behavior, video language, titles, tags, and your channel history to decide audience. Use English titles, tags, descriptions, and subtitles. Also, engage with English-speaking communities to build reach."
      },
      {
        "author": "tiffto1103",
        "content": "Using a VPN while uploading to YouTube is technically possible, but best to approach this carefully for a few reasons: Instead, you could try these approaches:"
      },
      {
        "author": "esgeeks",
        "content": "Yes, just make sure to optimize titles, descriptions and tags in English to improve reach."
      },
      {
        "author": "StanUrbanBikeRider",
        "content": "Try doing it. Then you’ll know."
      }
    ],
    "thread_title": "Can I use VPN when I upload YouTube vids?",
    "thread_url": "https://old.reddit.com/r/VPN/comments/1k7b0o4/can_i_use_vpn_when_i_upload_youtube_vids/",
    "username": "mylittlekitty06",
    "timestamp": "2025-05-14",
    "scrape_time": "2025-05-14T13:07:26.738591"
  },
  {
    "id": "1kiw4pu",
    "title": "Is it even possible that my VPN is causing my ISP to not be able to track data?",
    "author": "BrekoPorter",
    "permalink": "https://old.reddit.com/r/VPN/comments/1kiw4pu/is_it_even_possible_that_my_vpn_is_causing_my_isp/",
    "content": "Don't be abusive. No commercial/affiliate links. No irrelevant personal sites. Use your service's official support channel. Be vendor neutral. Link to subs, not specific posts. Back up your claims with proof. Read Reddit's Reddiquette, Rules, and FAQ. Do not ask for any recommendations for VPN services. ​Posts with recommendations will be removed Failure to follow the above may result in banning or post removal without warning. New accounts are temporarily moderated. All moderated posts are manually reviewed and if on topic should be approved with in 24 hours of posting. The spam filter can get a little overzealous sometimes. If you make a post and then can't find it, it's probably there. Please message the moderators and we'll review it.",
    "comments": [
      {
        "author": "berahi",
        "content": "Nah, it's just coincidental. There are some VPN deliberately designed to use custom SNI host to trick the ISP to consider it as a free rated traffic (usually the idea is to subscribe to cheap app-specific plan and masquerade the traffic as belonging to that app), but seeing how your wifi cameras don't count, then it's not because of the VPN. Most likely the ISP metering and/or reporting is bugged, just use your internet as usual, they'd fix it later."
      },
      {
        "author": "ajkewl245a",
        "content": "I wonder if you started checking right when your one billing cycle ended and the next one began, so it's showing that you haven't used any data yet this month? Because otherwise it doesn't make sense to me."
      },
      {
        "author": "need2sleep-later",
        "content": "So the obvious thing to do is to spend a day off the VPN and see what your usage is."
      }
    ],
    "thread_title": "Is it even possible that my VPN is causing my ISP to not be able to track data?",
    "thread_url": "https://old.reddit.com/r/VPN/comments/1kiw4pu/is_it_even_possible_that_my_vpn_is_causing_my_isp/",
    "username": "BrekoPorter",
    "timestamp": "2025-05-14",
    "scrape_time": "2025-05-14T13:07:39.277529"
  },
  {
    "id": "1klauxm",
    "title": "Stupid question",
    "author": "Thin-Comfortable4805",
    "permalink": "https://old.reddit.com/r/VPN/comments/1klauxm/stupid_question/",
    "content": "Don't be abusive. No commercial/affiliate links. No irrelevant personal sites. Use your service's official support channel. Be vendor neutral. Link to subs, not specific posts. Back up your claims with proof. Read Reddit's Reddiquette, Rules, and FAQ. Do not ask for any recommendations for VPN services. ​Posts with recommendations will be removed Failure to follow the above may result in banning or post removal without warning. New accounts are temporarily moderated. All moderated posts are manually reviewed and if on topic should be approved with in 24 hours of posting. The spam filter can get a little overzealous sometimes. If you make a post and then can't find it, it's probably there. Please message the moderators and we'll review it.",
    "comments": [
      {
        "author": "Pitiful-Escape8732",
        "content": "No it won't affect it so don't worry, yes you can watch porn and no your mom's company won't be able to tell your mom. Unless you do it on her laptop."
      },
      {
        "author": "Thin-Comfortable4805",
        "content": "It wasn’t about porn. It was more of a question regarding VPN because I heard that some games can ban you for using a VPN and didnt want to experience that lol. Thanks for the laugh though. Unfortunately circumstances changed in my life and my mom had to come live with me."
      },
      {
        "author": "TheBigBeardedGeek",
        "content": "So it doesn't affect anything else any more than it simply being on the home WiFi would affect things without the VPN. First, your home WiFi is like a high speed traffic system. Not every device gets to go at once, and there's only so much traffic that can go at a time. Now this all bursts so fast, you generally don't notice it unless you have A LOT of bandwidth heavy traffic. Her Teams call is doing more bandwidth than the VPN is. Which brings me to why the VPN doesn't really change things. You see, she is using virtually every part of the home network. A VPN just kinda wraps up the traffic and routes it somewhere else to \"exit.\" It can be a device in a corporate data center, or it can be a server in some Scandinavian country with loose copyright laws. It's still going through your network, it just gets secured and shunted along elsewhere. As an addendum, most corporate VPNs will \"split\" the traffic. Stuff destined for the corpo environment will go through the VPN, and stuff headed to the wild Internet won't. Saves bandwidth for the corp and reduces latency for the user."
      },
      {
        "author": "Thin-Comfortable4805",
        "content": "Thanks for answering my dude. The only reason why I asked a dumb question because a few years ago MW2 was banning people for wild things and didn’t want to have any issues."
      },
      {
        "author": "iOSCaleb",
        "content": "The VPN still runs over your home network connection, so you have to share that bandwidth. If you were to, say, start transferring a huge amount of content, your mom might notice her connection slowing down. But if you live in an urban or suburban setting and have a typical broadband connection and can stream video, you’d have to work pretty hard for bandwidth to be a problem. Just ask her to tell you if she notices any hiccups."
      },
      {
        "author": "JulesCT",
        "content": "The VPN establishes a secure, encrypted 'tunnel' through your local network, across the ISP's network and pops out, literally, at the company's end destination where it is unencrypted. Typically, for a company, this is inside their own network. The VPN has no knowledge of the other traffic around it nor does it affect it, and the same goes for devices along the path of your mum's laptop's communicating to the company location. Your browsing and surfing habits are unaffected as long as she's not a bandwidth hog."
      },
      {
        "author": "steathrazor",
        "content": "As long as you don't have the VPN setup to the router it shouldn't affect the use of a VPN on a single computer"
      }
    ],
    "thread_title": "Stupid question",
    "thread_url": "https://old.reddit.com/r/VPN/comments/1klauxm/stupid_question/",
    "username": "Thin-Comfortable4805",
    "timestamp": "2025-05-14",
    "scrape_time": "2025-05-14T13:07:53.568882"
  },
  {
    "id": "1kk5ot1",
    "title": "Is his normal for VPN's? Sites like Google/Amazon do not work with split-tunneling?",
    "author": "bufflow08",
    "permalink": "https://old.reddit.com/r/VPN/comments/1kk5ot1/is_his_normal_for_vpns_sites_like_googleamazon_do/",
    "content": "Don't be abusive. No commercial/affiliate links. No irrelevant personal sites. Use your service's official support channel. Be vendor neutral. Link to subs, not specific posts. Back up your claims with proof. Read Reddit's Reddiquette, Rules, and FAQ. Do not ask for any recommendations for VPN services. ​Posts with recommendations will be removed Failure to follow the above may result in banning or post removal without warning. New accounts are temporarily moderated. All moderated posts are manually reviewed and if on topic should be approved with in 24 hours of posting. The spam filter can get a little overzealous sometimes. If you make a post and then can't find it, it's probably there. Please message the moderators and we'll review it.",
    "comments": [
      {
        "author": "bufflow08",
        "content": "I think I figured out the reason, and a workaround, but it's certainly annoying. It looks the VPN has a DNS leak, what happens is the VPN's DNS leaks into the apps that DONT have it enabled. By manually updating the DNS settings for each of the browsers, sites like Amazon/Google work. The workaround is to manually update the browser to use a specific DNS (Google, Cloudflare, etc). This doesn't solve the problem entirely as you're now having to do this for every other program."
      },
      {
        "author": "Kindly-Discipline-53",
        "content": "I'm glad to know there's a workaround, even if it annoying, but how exactly do you update Brave to use a specific DNS?"
      },
      {
        "author": "bufflow08",
        "content": "brave://settings/security?search=dns You can select a provider from the list. Make sure you test it with one of the dns leak sites to ensure it's fuctioning."
      },
      {
        "author": "Kindly-Discipline-53",
        "content": "Thanks very much!"
      },
      {
        "author": "Suicide-Snot",
        "content": "Sounds like the VPN could be the problem also. A decent VPN shouldn’t have leaks. 👍"
      },
      {
        "author": "bufflow08",
        "content": "I'm reading that it's a Windows limitation, but I don't believe them. I'm using the most popular brand (I'm not mentioning it here so my post doesn't get removed)"
      },
      {
        "author": "Suicide-Snot",
        "content": "Ah, cool. Hope you get it fixed bro 👍"
      },
      {
        "author": "VintageLV",
        "content": "Do you have a kill switch turned on? Can't be on with split tunneling."
      },
      {
        "author": "bufflow08",
        "content": "Yes I do, but I'm confused why? Update: Just turned it off, still the same issue."
      },
      {
        "author": "VintageLV",
        "content": "Kill switches don't work well in Windows. It's either on or off, everything or nothing. You can try turning it off, rebooting, and trying again. If it doesn't work then, you may need to address it with your VPN."
      },
      {
        "author": "Suicide-Snot",
        "content": "Clear cookies etc and try again 👍"
      },
      {
        "author": "Accurate_Chair_3443",
        "content": "Yes it can. I have a kill switch on mine and my plex server running through split tunnel."
      }
    ],
    "thread_title": "Is his normal for VPN's? Sites like Google/Amazon do not work with split-tunneling?",
    "thread_url": "https://old.reddit.com/r/VPN/comments/1kk5ot1/is_his_normal_for_vpns_sites_like_googleamazon_do/",
    "username": "bufflow08",
    "timestamp": "2025-05-14",
    "scrape_time": "2025-05-14T13:08:05.078358"
  },
  {
    "id": "1khws5p",
    "title": "How does the 100% Rakuten Cashback work?",
    "author": "TheKrazyJuice",
    "permalink": "https://old.reddit.com/r/VPN/comments/1khws5p/how_does_the_100_rakuten_cashback_work/",
    "content": "Don't be abusive. No commercial/affiliate links. No irrelevant personal sites. Use your service's official support channel. Be vendor neutral. Link to subs, not specific posts. Back up your claims with proof. Read Reddit's Reddiquette, Rules, and FAQ. Do not ask for any recommendations for VPN services. ​Posts with recommendations will be removed Failure to follow the above may result in banning or post removal without warning. New accounts are temporarily moderated. All moderated posts are manually reviewed and if on topic should be approved with in 24 hours of posting. The spam filter can get a little overzealous sometimes. If you make a post and then can't find it, it's probably there. Please message the moderators and we'll review it.",
    "comments": [
      {
        "author": "PerformanceAshamed49",
        "content": "You pay for service through Rakuten site. You wait a few months and they give you a refund. Did mine with PayPal and got the $$ put right into my account."
      },
      {
        "author": "TheKrazyJuice",
        "content": "Did you get the basic 2 years?"
      },
      {
        "author": "PerformanceAshamed49",
        "content": "Yes"
      }
    ],
    "thread_title": "How does the 100% Rakuten Cashback work?",
    "thread_url": "https://old.reddit.com/r/VPN/comments/1khws5p/how_does_the_100_rakuten_cashback_work/",
    "username": "TheKrazyJuice",
    "timestamp": "2025-05-14",
    "scrape_time": "2025-05-14T13:08:15.935015"
  },
  {
    "id": "1kezawo",
    "title": "VPN + Subscriptions",
    "author": "SeparatedMiles",
    "permalink": "https://old.reddit.com/r/VPN/comments/1kezawo/vpn_subscriptions/",
    "content": "Don't be abusive. No commercial/affiliate links. No irrelevant personal sites. Use your service's official support channel. Be vendor neutral. Link to subs, not specific posts. Back up your claims with proof. Read Reddit's Reddiquette, Rules, and FAQ. Do not ask for any recommendations for VPN services. ​Posts with recommendations will be removed Failure to follow the above may result in banning or post removal without warning. New accounts are temporarily moderated. All moderated posts are manually reviewed and if on topic should be approved with in 24 hours of posting. The spam filter can get a little overzealous sometimes. If you make a post and then can't find it, it's probably there. Please message the moderators and we'll review it.",
    "comments": [
      {
        "author": "Orlan_17",
        "content": "It is so much easier to just sail the seas 🏴‍☠️"
      },
      {
        "author": "B9C1",
        "content": "ᴾᶦʳᵃᶜʸ"
      },
      {
        "author": "MaybeAnInventor",
        "content": "Hi there! Depends on the company and the subscription, can't be answered in general. But You are right: It becomes harder and harder"
      },
      {
        "author": "via62",
        "content": "depending on the platform, the VPN trick is not working anymore because it checks the country that your bank account is from so even with VPN you'll get the same price"
      },
      {
        "author": "jakgal04",
        "content": "Maybe, maybe not. There's hundreds of thousands of subscriptions out there and things are changing every day, nobody can give you a good answer."
      },
      {
        "author": "ProTechXS",
        "content": "Any respectable VPN provider will offer some form of money-back guarantee. Usually at least 72 hours - though the reputable ones will offer 30 days. You could purchase it and test it out, if it doesn't work, then at least it's not money wasted. But most subscription based services are starting to check card details to ensure it matches the store region."
      }
    ],
    "thread_title": "VPN + Subscriptions",
    "thread_url": "https://old.reddit.com/r/VPN/comments/1kezawo/vpn_subscriptions/",
    "username": "SeparatedMiles",
    "timestamp": "2025-05-14",
    "scrape_time": "2025-05-14T13:08:24.554018"
  },
  {
    "id": "1kbkob3",
    "title": "Commercial VPN or Home VPN for speed & latency?",
    "author": "J_Peterman_",
    "permalink": "https://old.reddit.com/r/VPN/comments/1kbkob3/commercial_vpn_or_home_vpn_for_speed_latency/",
    "content": "Don't be abusive. No commercial/affiliate links. No irrelevant personal sites. Use your service's official support channel. Be vendor neutral. Link to subs, not specific posts. Back up your claims with proof. Read Reddit's Reddiquette, Rules, and FAQ. Do not ask for any recommendations for VPN services. ​Posts with recommendations will be removed Failure to follow the above may result in banning or post removal without warning. New accounts are temporarily moderated. All moderated posts are manually reviewed and if on topic should be approved with in 24 hours of posting. The spam filter can get a little overzealous sometimes. If you make a post and then can't find it, it's probably there. Please message the moderators and we'll review it.",
    "comments": [
      {
        "author": "whatdafuhk",
        "content": "i'd go commercial due to your upload. but home would pretty much guarantee you won't have any issues accessing services"
      },
      {
        "author": "irishdonor",
        "content": "Commercial all the way but be prepared always to have a backup if necessary. Commercial offers a service that home will struggle to match for all your criteria and also security etc"
      },
      {
        "author": "[deleted]",
        "content": "[removed]"
      },
      {
        "author": "bufandatl",
        "content": "Latency will always be an issue when your exit point is the US. That’s just physics. I personally would say home VPN because your exit IP then would be a residential IP and not some data center IP services may block."
      },
      {
        "author": "qalpi",
        "content": "I'd go via home. Netflix might very well block you on commercial. Your home connection will look like just that, and it'll be your IP. Your upload is more than enough. I do this with Wireguard. Very low latency from the hardware, and get excellent speeds."
      },
      {
        "author": "illicITparameters",
        "content": "If it’s just for netflix and stuff I would go commercial."
      }
    ],
    "thread_title": "Commercial VPN or Home VPN for speed & latency?",
    "thread_url": "https://old.reddit.com/r/VPN/comments/1kbkob3/commercial_vpn_or_home_vpn_for_speed_latency/",
    "username": "J_Peterman_",
    "timestamp": "2025-05-14",
    "scrape_time": "2025-05-14T13:08:36.449205"
  },
  {
    "id": "1k8ylx9",
    "title": "Automatic DNS leak test",
    "author": "TourLegitimate4824",
    "permalink": "https://old.reddit.com/r/VPN/comments/1k8ylx9/automatic_dns_leak_test/",
    "content": "Don't be abusive. No commercial/affiliate links. No irrelevant personal sites. Use your service's official support channel. Be vendor neutral. Link to subs, not specific posts. Back up your claims with proof. Read Reddit's Reddiquette, Rules, and FAQ. Do not ask for any recommendations for VPN services. ​Posts with recommendations will be removed Failure to follow the above may result in banning or post removal without warning. New accounts are temporarily moderated. All moderated posts are manually reviewed and if on topic should be approved with in 24 hours of posting. The spam filter can get a little overzealous sometimes. If you make a post and then can't find it, it's probably there. Please message the moderators and we'll review it.",
    "comments": [
      {
        "author": "berahi",
        "content": "for my Raspberry Pi running qBittorrent Personally I'd just run gluetun with the qbt container, that way if the VPN isn't up, it won't connect, and it doesn't have to handle any other traffic. If the goal is simply making sure the VPN is connected and handling your traffic, instead of running a fat chromium instance just to load a DNS leak test, why not just curl to ipinfo.io? With curl user agent, it will tell you the public IP, ASN and associated info, since it's very lightweight and the free lite tier API don't have request limit, you can do it every minute if you're that paranoid. If you somehow don't trust your VPN not leaking DNS traffic (but still decide to pay for them...), dig the TXT record of whoami.ds.akahelp.net, you'll see your resolver IP, or recurse resolve yourself to get your public IP."
      },
      {
        "author": "kearkan",
        "content": "Yeah this seems an over complicated workaround to just using gluetun, lol. Impressive that it was made of course, will probably set it up myself just to see. But most people's concern is just piracy."
      }
    ],
    "thread_title": "Automatic DNS leak test",
    "thread_url": "https://old.reddit.com/r/VPN/comments/1k8ylx9/automatic_dns_leak_test/",
    "username": "TourLegitimate4824",
    "timestamp": "2025-05-14",
    "scrape_time": "2025-05-14T13:08:45.142230"
  },
  {
    "id": "1kcwy3c",
    "title": "\"To take a step into this world, outside of both the world of living and the world of the dead... you must be either very brave or mad.\"",
    "author": "MonolithGames_Off",
    "permalink": "https://alb.reddit.com/cr?za=JmeVsUeUxqspGNWCxBNTh0RuNlqU0xMH5dneBzOP4cEpriLuwyiPgVAEMFZ7WMaMgbFGuAaZFy-LSZQ0k5bIeDY_rpOSdHxrAYma5kVzT4PGf-bVgfkOKjEwbbYUJLpq2JRmSngg7g2aVR_w9c8q5QXiqetK6HspezjQatcH7ZVh81CCbL5gyk1uJizAhbT67OrQxokXP80l3QU1fSC0pXDbGcFAOqDE5DZhAaP7PmHvOxYd5oyNHNbdU8BjO76gPmnOjOIkHz6NXdWh0FYulh-X0XIHcFxtJ5TCEKN103ZR2E8i8Q2dRS9bYTAqDsnysqjCXjqFTjxWZOxEj2SJ-l-UCCpjNobavNAhfLGJcTffJYedcrTWO8cEh6fg19-_Y1f9D9lDIa187wVgBuQQBVGThq4J3ZvgYcDmf17WZs9qlo3l2LhoTRdpC_lI0UdImikI2p3KT4sIHV3Ppwr572PWR_0w3eSL-qlxcsNNCqtNcVPRKW5jkCJAXOgTTdR2buiJvrqIhca9h4chpgP_OZL8OVpLC6JfA4qbAfpEXTa29jMaNKd4Jzg&zp=9vlM3U674qgJJJr0OaJXgdH1od9YE7iSu6w5dI8n_aI_WWKY0gAzgNVRDXlXllGrsS8b9En98LRILjCpy4_FSwpaeGeiqxey9TI0PAAGw_eZpmctVQwXHplU52cVB8RXz-gdPfdo745hvDqKyMUt2gk4S8ZMD1k05z-PJ4QHeJdRUz4XY5-SIYiUsOGnCHOZ7ZH-QDykPFmz-248TkP8fgyGDSrGv7pe02L-sXFtyaZA4fX6ZVVdS7n-vuwUPVK17kFXsyOQWMMdW2Htnwcud4EhQg_B3UngfxqVkQUXGrhNv79i1I4JGaza4VYuE-m7Jcdb__SZRczUGdER1Tmc7_EptiBHlVoKO6TUMny6WhX-OaY",
    "content": "",
    "comments": [],
    "thread_title": "\"To take a step into this world, outside of both the world of living and the world of the dead... you must be either very brave or mad.\"",
    "thread_url": "https://alb.reddit.com/cr?za=JmeVsUeUxqspGNWCxBNTh0RuNlqU0xMH5dneBzOP4cEpriLuwyiPgVAEMFZ7WMaMgbFGuAaZFy-LSZQ0k5bIeDY_rpOSdHxrAYma5kVzT4PGf-bVgfkOKjEwbbYUJLpq2JRmSngg7g2aVR_w9c8q5QXiqetK6HspezjQatcH7ZVh81CCbL5gyk1uJizAhbT67OrQxokXP80l3QU1fSC0pXDbGcFAOqDE5DZhAaP7PmHvOxYd5oyNHNbdU8BjO76gPmnOjOIkHz6NXdWh0FYulh-X0XIHcFxtJ5TCEKN103ZR2E8i8Q2dRS9bYTAqDsnysqjCXjqFTjxWZOxEj2SJ-l-UCCpjNobavNAhfLGJcTffJYedcrTWO8cEh6fg19-_Y1f9D9lDIa187wVgBuQQBVGThq4J3ZvgYcDmf17WZs9qlo3l2LhoTRdpC_lI0UdImikI2p3KT4sIHV3Ppwr572PWR_0w3eSL-qlxcsNNCqtNcVPRKW5jkCJAXOgTTdR2buiJvrqIhca9h4chpgP_OZL8OVpLC6JfA4qbAfpEXTa29jMaNKd4Jzg&zp=9vlM3U674qgJJJr0OaJXgdH1od9YE7iSu6w5dI8n_aI_WWKY0gAzgNVRDXlXllGrsS8b9En98LRILjCpy4_FSwpaeGeiqxey9TI0PAAGw_eZpmctVQwXHplU52cVB8RXz-gdPfdo745hvDqKyMUt2gk4S8ZMD1k05z-PJ4QHeJdRUz4XY5-SIYiUsOGnCHOZ7ZH-QDykPFmz-248TkP8fgyGDSrGv7pe02L-sXFtyaZA4fX6ZVVdS7n-vuwUPVK17kFXsyOQWMMdW2Htnwcud4EhQg_B3UngfxqVkQUXGrhNv79i1I4JGaza4VYuE-m7Jcdb__SZRczUGdER1Tmc7_EptiBHlVoKO6TUMny6WhX-OaY",
    "username": "MonolithGames_Off",
    "timestamp": "2025-05-14",
    "scrape_time": "2025-05-14T13:08:59.004997"
  },
  {
    "id": "1k25ocd",
    "title": "What can website see?",
    "author": "eastmanlairdfan",
    "permalink": "https://old.reddit.com/r/VPN/comments/1k25ocd/what_can_website_see/",
    "content": "Don't be abusive. No commercial/affiliate links. No irrelevant personal sites. Use your service's official support channel. Be vendor neutral. Link to subs, not specific posts. Back up your claims with proof. Read Reddit's Reddiquette, Rules, and FAQ. Do not ask for any recommendations for VPN services. ​Posts with recommendations will be removed Failure to follow the above may result in banning or post removal without warning. New accounts are temporarily moderated. All moderated posts are manually reviewed and if on topic should be approved with in 24 hours of posting. The spam filter can get a little overzealous sometimes. If you make a post and then can't find it, it's probably there. Please message the moderators and we'll review it.",
    "comments": [
      {
        "author": "VintageLV",
        "content": "Your browser fingerprint and that's really it. The VPN is going to change your location and IP."
      },
      {
        "author": "eastmanlairdfan",
        "content": "By browser fingerprint, what do you mean? Is it that all they can see is that someone logged on using the disguised location and iP?"
      },
      {
        "author": "VintageLV",
        "content": "Your browser uses a unique fingerprint, which can be tied to your IP and location. There are some browsers which actively change your fingerprint because of this. I use Brave and love it. Ultimately, what's your intention in using a VPN?"
      },
      {
        "author": "Upset_Exercise",
        "content": "I presume based on his question it would be privacy"
      },
      {
        "author": "hibachi26",
        "content": "What are some good search engines besides Google, yahoo, Bing, duckduckgo, yandex, msn"
      },
      {
        "author": "wase471111",
        "content": "they see everything, aside from your current IP address; VPN's do NOTHINH against fingerprinting, which is the current defacto intrusion into your privacy, so NO VPN will block fingerprinting from being seen So yes, everyone will see what porn you spend your days looking at..."
      },
      {
        "author": "illusion_2439",
        "content": "I am owner of firestickhacks website we can see user ip and device details country and where they click on our website so we can optimise website"
      },
      {
        "author": "Original-Carob7196",
        "content": "They can still see what browser you're using, your screen resolution, some system info, and any cookies you accept. If you log in or fill out forms, they get that info too. The VPN hides your real IP and location, but anything you give directly is still visible."
      },
      {
        "author": "billdietrich1",
        "content": "Test with browserleaks.com"
      }
    ],
    "thread_title": "What can website see?",
    "thread_url": "https://old.reddit.com/r/VPN/comments/1k25ocd/what_can_website_see/",
    "username": "eastmanlairdfan",
    "timestamp": "2025-05-14",
    "scrape_time": "2025-05-14T13:09:10.716647"
  },
  {
    "id": "1k1fe3n",
    "title": "Another Newbie With Questions",
    "author": "FantasticDuplex",
    "permalink": "https://old.reddit.com/r/VPN/comments/1k1fe3n/another_newbie_with_questions/",
    "content": "Don't be abusive. No commercial/affiliate links. No irrelevant personal sites. Use your service's official support channel. Be vendor neutral. Link to subs, not specific posts. Back up your claims with proof. Read Reddit's Reddiquette, Rules, and FAQ. Do not ask for any recommendations for VPN services. ​Posts with recommendations will be removed Failure to follow the above may result in banning or post removal without warning. New accounts are temporarily moderated. All moderated posts are manually reviewed and if on topic should be approved with in 24 hours of posting. The spam filter can get a little overzealous sometimes. If you make a post and then can't find it, it's probably there. Please message the moderators and we'll review it.",
    "comments": [
      {
        "author": "kearkan",
        "content": "1) some clients have an \"allow local traffic\" option which will fix this. The answer is yes, if you're not sure how to do it check if it can easily be done before you buy. 2) No, saved passwords are on your PC and just looks at the URL. What you might find is that you are getting more captchas from Google and other sites 3) this is usually a setting in the VPN app, you can usually have it turn on automatically and have a Killswitch for if it loses connection. Manually connecting and disconnecting will be fine 99% of the time. 4) No, installed programs should be fine unless they block the VPN IP but this is more a website thing than something like Adobe. 5) the available countries entirely depends on what service you pick. As for what country is best, doesn't matter. If you want the smallest impact on speed pick your closest server. 6) again that depends. For most services while you're connected you'll have the same IP, usually if you just pick a \"best server\" option or only pick country without picking a particular server in the country it will pick whatever has the lowest load, which might be different to the one you previously picked. If your goal is anonymity you DON'T want a dedicated IP. The whole point is your traffic gets thrown in with a bunch of other people's. Why do you think you might need to sometimes change IP?"
      },
      {
        "author": "FantasticDuplex",
        "content": "Thank you for your answers! I don't know enough about IPs to know if I will need to change IPs. I guess I was just wondering if for whatever reason, a country or IP that I was using was blocked by a site or program or something, I could change it? I use QuickBooks Online regularly, as well as other online-based software, and am not totally sure how they will work if I use a VPN. I also have MalwareBytes for virus protection, and I really like it, so not sure if a VPN will interfere with that as well."
      },
      {
        "author": "MonkeyBrains09",
        "content": "You could potentially setup a VPN on your router so everything connected to gets routed to the VPN server before going to the Internet. check out the r/privacy subreddit if your interested in learning more on how to be anonymous or private online because those are two separate things."
      },
      {
        "author": "FantasticDuplex",
        "content": "Thanks! Yeah, I am not sure I want it installed on my router (we have 2 routers) just because we have so many other things connected to WiFi. I didn't want it to interfere with streaming services, or our smart home things we have - cameras, lights, etc..."
      }
    ],
    "thread_title": "Another Newbie With Questions",
    "thread_url": "https://old.reddit.com/r/VPN/comments/1k1fe3n/another_newbie_with_questions/",
    "username": "FantasticDuplex",
    "timestamp": "2025-05-14",
    "scrape_time": "2025-05-14T13:09:24.952794"
  },
  {
    "id": "1khmp7f",
    "title": "I am looking for a solution to my ping problem for codmobile paid service",
    "author": "statesbraun32",
    "permalink": "https://old.reddit.com/r/VPN/comments/1khmp7f/i_am_looking_for_a_solution_to_my_ping_problem/",
    "content": "Don't be abusive. No commercial/affiliate links. No irrelevant personal sites. Use your service's official support channel. Be vendor neutral. Link to subs, not specific posts. Back up your claims with proof. Read Reddit's Reddiquette, Rules, and FAQ. Do not ask for any recommendations for VPN services. ​Posts with recommendations will be removed Failure to follow the above may result in banning or post removal without warning. New accounts are temporarily moderated. All moderated posts are manually reviewed and if on topic should be approved with in 24 hours of posting. The spam filter can get a little overzealous sometimes. If you make a post and then can't find it, it's probably there. Please message the moderators and we'll review it.",
    "comments": [
      {
        "author": "VintageLV",
        "content": "What's the ping problem?"
      }
    ],
    "thread_title": "I am looking for a solution to my ping problem for codmobile paid service",
    "thread_url": "https://old.reddit.com/r/VPN/comments/1khmp7f/i_am_looking_for_a_solution_to_my_ping_problem/",
    "username": "statesbraun32",
    "timestamp": "2025-05-14",
    "scrape_time": "2025-05-14T13:09:38.246998"
  },
  {
    "id": "1kfxz8n",
    "title": "Downside of using your own dns resolver when using vpn?",
    "author": "Horror_Kick6188",
    "permalink": "https://old.reddit.com/r/VPN/comments/1kfxz8n/downside_of_using_your_own_dns_resolver_when/",
    "content": "Don't be abusive. No commercial/affiliate links. No irrelevant personal sites. Use your service's official support channel. Be vendor neutral. Link to subs, not specific posts. Back up your claims with proof. Read Reddit's Reddiquette, Rules, and FAQ. Do not ask for any recommendations for VPN services. ​Posts with recommendations will be removed Failure to follow the above may result in banning or post removal without warning. New accounts are temporarily moderated. All moderated posts are manually reviewed and if on topic should be approved with in 24 hours of posting. The spam filter can get a little overzealous sometimes. If you make a post and then can't find it, it's probably there. Please message the moderators and we'll review it.",
    "comments": [
      {
        "author": "berahi",
        "content": "If the site you visit attempt to profile you, they can also see what upstream you're using, which makes you a bit more unique since normally the VPN client will just use their own upstream. This is usually not a problem for the average VPN users, you're already giving far more unique identifiers with the average browser anyway"
      },
      {
        "author": "c0sf",
        "content": "As a secondary effect of this, streaming sites can also figure out your real geolocation, so, bypassing geolocation based content filtering on streaming platforms doesn't work"
      }
    ],
    "thread_title": "Downside of using your own dns resolver when using vpn?",
    "thread_url": "https://old.reddit.com/r/VPN/comments/1kfxz8n/downside_of_using_your_own_dns_resolver_when/",
    "username": "Horror_Kick6188",
    "timestamp": "2025-05-14",
    "scrape_time": "2025-05-14T13:09:47.900927"
  },
  {
    "id": "1ke5hkl",
    "title": "Home VPN, Wireguard, and DPI?",
    "author": "osssssssx",
    "permalink": "https://old.reddit.com/r/VPN/comments/1ke5hkl/home_vpn_wireguard_and_dpi/",
    "content": "Don't be abusive. No commercial/affiliate links. No irrelevant personal sites. Use your service's official support channel. Be vendor neutral. Link to subs, not specific posts. Back up your claims with proof. Read Reddit's Reddiquette, Rules, and FAQ. Do not ask for any recommendations for VPN services. ​Posts with recommendations will be removed Failure to follow the above may result in banning or post removal without warning. New accounts are temporarily moderated. All moderated posts are manually reviewed and if on topic should be approved with in 24 hours of posting. The spam filter can get a little overzealous sometimes. If you make a post and then can't find it, it's probably there. Please message the moderators and we'll review it.",
    "comments": [
      {
        "author": "kearkan",
        "content": "You're correct. Since the DPI that the company could do is traffic to/from their network, what they would see would be after the VPN headers have been added and removed again."
      }
    ],
    "thread_title": "Home VPN, Wireguard, and DPI?",
    "thread_url": "https://old.reddit.com/r/VPN/comments/1ke5hkl/home_vpn_wireguard_and_dpi/",
    "username": "osssssssx",
    "timestamp": "2025-05-14",
    "scrape_time": "2025-05-14T13:09:58.857532"
  },
  {
    "id": "1k7xrao",
    "title": "VPN browser conflict with Steam Vac",
    "author": "Ringwald_7",
    "permalink": "https://old.reddit.com/r/VPN/comments/1k7xrao/vpn_browser_conflict_with_steam_vac/",
    "content": "Don't be abusive. No commercial/affiliate links. No irrelevant personal sites. Use your service's official support channel. Be vendor neutral. Link to subs, not specific posts. Back up your claims with proof. Read Reddit's Reddiquette, Rules, and FAQ. Do not ask for any recommendations for VPN services. ​Posts with recommendations will be removed Failure to follow the above may result in banning or post removal without warning. New accounts are temporarily moderated. All moderated posts are manually reviewed and if on topic should be approved with in 24 hours of posting. The spam filter can get a little overzealous sometimes. If you make a post and then can't find it, it's probably there. Please message the moderators and we'll review it.",
    "comments": [
      {
        "author": "berahi",
        "content": "Dual boot and only use your work apps in the dedicated OS?"
      },
      {
        "author": "goodpricefriedrice",
        "content": "100% best suggestion. Keep your work and personal separate. Ideally different computers, but if your company doesn't provide a laptop, then dual boot is a very good fallback solution"
      },
      {
        "author": "Ringwald_7",
        "content": "Thanks to both of you. I'm not savvy enough to know what dual booting is but I can ask my brother and do some research"
      },
      {
        "author": "Selene_Whiz",
        "content": "You’re not banned yet, but you’re right to be careful. VAC can flag VPNs and weird background programs as suspicious. Best bet is to fully close or sandbox Browserjet when gaming, or use a separate PC/profile for work stuff if you can."
      },
      {
        "author": "Ringwald_7",
        "content": "I had it closed when I opened CS that time, and it was picking up on it anyway. What does sandbox mean?"
      }
    ],
    "thread_title": "VPN browser conflict with Steam Vac",
    "thread_url": "https://old.reddit.com/r/VPN/comments/1k7xrao/vpn_browser_conflict_with_steam_vac/",
    "username": "Ringwald_7",
    "timestamp": "2025-05-14",
    "scrape_time": "2025-05-14T13:10:12.134978"
  }
]