[
    {
        "source": "darkweb",
        "forum": "SuprBay",
        "thread_url": "http://suprbaydvdcaynfo4dgdzgxb4zuso7rftlil5yg5kqjefnw4wq4ulcad.onion/Thread-Apple-is-tracking-you-even-when-its-own-privacy-settings-say-it%E2%80%99s-not",
        "thread_title": "Apple is tracking you even when its own privacy settings say it’s not",
        "post_id": "post_362937",
        "username": "Resurgence",
        "timestamp": "Nov 09, 2022, 14:58 pm",
        "content": "Written by Thomas Germain Published: November 9, 2022 For all of Apple’s talk about how private your iPhone is, the company vacuums up a lot of data about you. iPhones do have a privacy setting that is supposed to turn off that tracking. According to a new report by independent researchers, though, Apple collects extremely detailed information on you with its own apps even when you turn off tracking, an apparent direct contradiction of Apple’s own description of how the privacy protection works. The iPhone Analytics setting makes an explicit promise. Turn it off, and Apple says that it will “disable the sharing of Device Analytics altogether.” However, Tommy Mysk and Talal Haj Bakry, two app developers and security researchers at the software company Mysk, took a look at the data collected by a number of Apple iPhone apps—the App Store, Apple Music, Apple TV, Books, and Stocks. They found the analytics control and other privacy settings had no obvious effect on Apple’s data collection—the tracking remained the same whether iPhone Analytics was switched on or off. “The level of detail is shocking for a company like Apple,” Mysk told Gizmodo. The App Store appeared to harvest information about every single thing you did in real time, including what you tapped on, which apps you search for, what ads you saw, and how long you looked at a given app and how you found it. The app sent details about you and your device as well, including ID numbers, what kind of phone you’re using, your screen resolution, your keyboard languages, how you’re connected to the internet—notably, the kind of information commonly used for device fingerprinting. “Opting-out or switching the personalization options off did not reduce the amount of detailed analytics that the app was sending,” Mysk said. “I switched all the possible options off, namely personalized ads, personalized recommendations, and sharing usage data and analytics.” Apple did not respond to multiple requests for comment. Gizmodo requested that Mysk examine a few other Apple apps for comparison. The researchers said that the Health and Wallet apps, for example, didn’t transmit any analytics data at all, regardless of whether the iPhone Analytics setting was on or off, whereas Apple Music, Apple TV, Books, the iTunes Store, and Stocks all did. Most of the apps that sent analytics data shared consistent ID numbers, which would allow Apple to track your activity across its services, the researchers found. For example, the Stocks app sent Apple your list of watched stocks, the names stocks you viewed or searched for and time stamps for when you did it, as well as a record of any news articles you see in the app, according to Mysk’s analysis for Gizmodo. The information was sent to a web address labeled analytics, . That transmission was separate from the iCloud communication necessary to sync your data across devices. Unlike the other apps, however, Stocks sent different ID numbers and far less detailed device information. The researchers checked their work on two different devices. First, they used a jail broken iPhone running iOS 14.6, which allowed them to decrypt the traffic and examine exactly what data was being sent. Apple introduced App Tracking Transparency in iOS 14.5, cuing users to decide whether or not to give their data to individual apps with the prompt “Ask app not to track?” The researchers also examined a regular iPhone running iOS 16, the latest operating system, which bolstered their findings. There is little reason to think that the jail broken phone would send different data, they said, but On iOS 16, they saw the same apps sending similar packets of data to the same Apple web addresses. The data was transmitted at the same times under the same circumstances, and turning the available privacy settings on and off likewise didn’t change anything. The researchers couldn’t examine exactly what data was sent because the phone’s encryption remained intact, but the similarities suggest this may be standard behavior on the iPhone. It’s impossible to know what Apple is doing with the data without the company’s own explanation, and as is so often the case, Apple has been silent so far. It’s entirely possible that Apple doesn’t use the information if you turn the settings off, but that’s not how the company explains what the settings do in its privacy policy. This isn’t an every-app-is-tracking-me-so-what’s-one-more situation. These findings are out of line with standard industry practices, Mysk says. He and his research partner ran similar tests in the past looking at analytics in Google Chrome and Microsoft Edge. In both of those apps, Mysk says the data isn’t sent when analytics settings are turned off. Privacy is one of the main issues that Apple uses to set its products apart from competitors. It emblazoned 40-foot billboards of the iPhone with the simple slogan “Privacy. That’s iPhone.” and ran the ads across the world for months. But the company is slowly introducing many of the internet’s privacy issues into the once sacrosanct Apple ecosystem. Apple is working hard to build an advertising empire. Apple’s ad network runs on your personal information just like the ones Google and Meta operate, albeit in a more reserved way. Along the way, Apple developed a very convenient definition of what privacy means that lets the company criticize its rivals’ privacy practices while harvesting your data for similar purposes. Apple says you shouldn’t think of what it does as “tracking.” According to the company’s website: Quote: Apple’s advertising platform does not track you, meaning that it does not link user or device data collected from our apps with user or device data collected from third parties for targeted advertising or advertising measurement purposes, and does not share user or device data with data brokers. In other words, it’s not tracking unless you’re linking together data collected from services owned by different companies. If only one company—Apple—is collecting the data, then by Apple’s definition, it’s not tracking. Of course, that’s different from the definition of tracking that everyone else seems to use. It’s no surprise that Apple is collecting analytics information, the practice is laid out in the privacy policy, and almost every app and device you use probably uses your data for analytics. But Mysk said he’s stunned at the level of detail. “I expected from a company like Apple, that believes that privacy is a fundamental human right, to collect more generic analytics,” Mysk said. What happens on your iPhone stays on your iPhone, unless you count the mountains of information your iPhone sends to Apple.",
        "tokens": [
            "written",
            "thomas",
            "germain",
            "published",
            "november",
            "9",
            "2022",
            "apple",
            "talk",
            "private",
            "iphone",
            "company",
            "vacuums",
            "lot",
            "data",
            "iphones",
            "privacy",
            "setting",
            "supposed",
            "turn",
            "tracking",
            "according",
            "new",
            "report",
            "independent",
            "researchers",
            "though",
            "apple",
            "collects",
            "extremely",
            "detailed",
            "information",
            "apps",
            "even",
            "turn",
            "tracking",
            "apparent",
            "direct",
            "contradiction",
            "apple",
            "description",
            "privacy",
            "protection",
            "works",
            "iphone",
            "analytics",
            "setting",
            "makes",
            "explicit",
            "promise",
            "turn",
            "apple",
            "says",
            "disable",
            "sharing",
            "device",
            "analytics",
            "however",
            "tommy",
            "mysk",
            "talal",
            "haj",
            "bakry",
            "two",
            "app",
            "developers",
            "security",
            "researchers",
            "software",
            "company",
            "mysk",
            "took",
            "look",
            "data",
            "collected",
            "number",
            "apple",
            "iphone",
            "app",
            "store",
            "apple",
            "music",
            "apple",
            "tv",
            "books",
            "stocks",
            "found",
            "analytics",
            "control",
            "privacy",
            "settings",
            "obvious",
            "effect",
            "apple",
            "data",
            "tracking",
            "remained",
            "whether",
            "iphone",
            "analytics",
            "switched",
            "level",
            "detail",
            "shocking",
            "company",
            "like",
            "apple",
            "mysk",
            "told",
            "gizmodo",
            "app",
            "store",
            "appeared",
            "harvest",
            "information",
            "every",
            "single",
            "thing",
            "real",
            "time",
            "including",
            "tapped",
            "apps",
            "search",
            "ads",
            "saw",
            "long",
            "looked",
            "given",
            "app",
            "found",
            "app",
            "sent",
            "details",
            "device",
            "well",
            "including",
            "id",
            "numbers",
            "kind",
            "phone",
            "using",
            "screen",
            "resolution",
            "keyboard",
            "languages",
            "connected",
            "kind",
            "information",
            "commonly",
            "used",
            "device",
            "fingerprinting",
            "switching",
            "personalization",
            "options",
            "reduce",
            "amount",
            "detailed",
            "analytics",
            "app",
            "sending",
            "mysk",
            "said",
            "switched",
            "possible",
            "options",
            "namely",
            "personalized",
            "ads",
            "personalized",
            "recommendations",
            "sharing",
            "usage",
            "data",
            "apple",
            "respond",
            "multiple",
            "requests",
            "comment",
            "gizmodo",
            "requested",
            "mysk",
            "examine",
            "apple",
            "apps",
            "comparison",
            "researchers",
            "said",
            "health",
            "wallet",
            "apps",
            "example",
            "transmit",
            "analytics",
            "data",
            "regardless",
            "whether",
            "iphone",
            "analytics",
            "setting",
            "whereas",
            "apple",
            "music",
            "apple",
            "tv",
            "books",
            "itunes",
            "store",
            "stocks",
            "apps",
            "sent",
            "analytics",
            "data",
            "shared",
            "consistent",
            "id",
            "numbers",
            "would",
            "allow",
            "apple",
            "track",
            "activity",
            "across",
            "services",
            "researchers",
            "found",
            "example",
            "stocks",
            "app",
            "sent",
            "apple",
            "list",
            "watched",
            "stocks",
            "names",
            "stocks",
            "viewed",
            "searched",
            "time",
            "stamps",
            "well",
            "record",
            "news",
            "articles",
            "see",
            "app",
            "according",
            "mysk",
            "analysis",
            "gizmodo",
            "information",
            "sent",
            "web",
            "address",
            "labeled",
            "analytics",
            "transmission",
            "separate",
            "icloud",
            "communication",
            "necessary",
            "sync",
            "data",
            "across",
            "devices",
            "unlike",
            "apps",
            "however",
            "stocks",
            "sent",
            "different",
            "id",
            "numbers",
            "far",
            "less",
            "detailed",
            "device",
            "information",
            "researchers",
            "checked",
            "work",
            "two",
            "different",
            "devices",
            "first",
            "used",
            "jail",
            "broken",
            "iphone",
            "running",
            "ios",
            "allowed",
            "decrypt",
            "traffic",
            "examine",
            "exactly",
            "data",
            "sent",
            "apple",
            "introduced",
            "app",
            "tracking",
            "transparency",
            "ios",
            "cuing",
            "users",
            "decide",
            "whether",
            "give",
            "data",
            "individual",
            "apps",
            "prompt",
            "ask",
            "app",
            "track",
            "researchers",
            "also",
            "examined",
            "regular",
            "iphone",
            "running",
            "ios",
            "16",
            "latest",
            "operating",
            "system",
            "bolstered",
            "findings",
            "little",
            "reason",
            "think",
            "jail",
            "broken",
            "phone",
            "would",
            "send",
            "different",
            "data",
            "said",
            "ios",
            "16",
            "saw",
            "apps",
            "sending",
            "similar",
            "packets",
            "data",
            "apple",
            "web",
            "addresses",
            "data",
            "transmitted",
            "times",
            "circumstances",
            "turning",
            "available",
            "privacy",
            "settings",
            "likewise",
            "change",
            "anything",
            "researchers",
            "examine",
            "exactly",
            "data",
            "sent",
            "phone",
            "encryption",
            "remained",
            "intact",
            "similarities",
            "suggest",
            "may",
            "standard",
            "behavior",
            "iphone",
            "impossible",
            "know",
            "apple",
            "data",
            "without",
            "company",
            "explanation",
            "often",
            "case",
            "apple",
            "silent",
            "far",
            "entirely",
            "possible",
            "apple",
            "use",
            "information",
            "turn",
            "settings",
            "company",
            "explains",
            "settings",
            "privacy",
            "policy",
            "situation",
            "findings",
            "line",
            "standard",
            "industry",
            "practices",
            "mysk",
            "says",
            "research",
            "partner",
            "ran",
            "similar",
            "tests",
            "past",
            "looking",
            "analytics",
            "google",
            "chrome",
            "microsoft",
            "edge",
            "apps",
            "mysk",
            "says",
            "data",
            "sent",
            "analytics",
            "settings",
            "turned",
            "privacy",
            "one",
            "main",
            "issues",
            "apple",
            "uses",
            "set",
            "products",
            "apart",
            "competitors",
            "emblazoned",
            "billboards",
            "iphone",
            "simple",
            "slogan",
            "privacy",
            "ran",
            "ads",
            "across",
            "world",
            "months",
            "company",
            "slowly",
            "introducing",
            "many",
            "internet",
            "privacy",
            "issues",
            "sacrosanct",
            "apple",
            "ecosystem",
            "apple",
            "working",
            "hard",
            "build",
            "advertising",
            "empire",
            "apple",
            "ad",
            "network",
            "runs",
            "personal",
            "information",
            "like",
            "ones",
            "google",
            "meta",
            "operate",
            "albeit",
            "reserved",
            "way",
            "along",
            "way",
            "apple",
            "developed",
            "convenient",
            "definition",
            "privacy",
            "means",
            "lets",
            "company",
            "criticize",
            "rivals",
            "privacy",
            "practices",
            "harvesting",
            "data",
            "similar",
            "purposes",
            "apple",
            "says",
            "think",
            "according",
            "company",
            "website",
            "quote",
            "apple",
            "advertising",
            "platform",
            "track",
            "meaning",
            "link",
            "user",
            "device",
            "data",
            "collected",
            "apps",
            "user",
            "device",
            "data",
            "collected",
            "third",
            "parties",
            "targeted",
            "advertising",
            "advertising",
            "measurement",
            "purposes",
            "share",
            "user",
            "device",
            "data",
            "data",
            "brokers",
            "words",
            "tracking",
            "unless",
            "linking",
            "together",
            "data",
            "collected",
            "services",
            "owned",
            "different",
            "companies",
            "one",
            "collecting",
            "data",
            "apple",
            "definition",
            "tracking",
            "course",
            "different",
            "definition",
            "tracking",
            "everyone",
            "else",
            "seems",
            "use",
            "surprise",
            "apple",
            "collecting",
            "analytics",
            "information",
            "practice",
            "laid",
            "privacy",
            "policy",
            "almost",
            "every",
            "app",
            "device",
            "use",
            "probably",
            "uses",
            "data",
            "analytics",
            "mysk",
            "said",
            "stunned",
            "level",
            "detail",
            "expected",
            "company",
            "like",
            "apple",
            "believes",
            "privacy",
            "fundamental",
            "human",
            "right",
            "collect",
            "generic",
            "analytics",
            "mysk",
            "said",
            "happens",
            "iphone",
            "stays",
            "iphone",
            "unless",
            "count",
            "mountains",
            "information",
            "iphone",
            "sends",
            "apple"
        ],
        "scrape_time": "2025-05-09T20:16:22.923130"
    },
    {
        "source": "darkweb",
        "forum": "SuprBay",
        "thread_url": "http://suprbaydvdcaynfo4dgdzgxb4zuso7rftlil5yg5kqjefnw4wq4ulcad.onion/Thread-Apple-is-tracking-you-even-when-its-own-privacy-settings-say-it%E2%80%99s-not",
        "thread_title": "Apple is tracking you even when its own privacy settings say it’s not",
        "post_id": "post_meta_362937",
        "username": "Anonymous",
        "timestamp": "Unknown",
        "content": "",
        "tokens": [],
        "scrape_time": "2025-05-09T20:16:22.923559"
    },
    {
        "source": "darkweb",
        "forum": "SuprBay",
        "thread_url": "http://suprbaydvdcaynfo4dgdzgxb4zuso7rftlil5yg5kqjefnw4wq4ulcad.onion/Thread-Apple-is-tracking-you-even-when-its-own-privacy-settings-say-it%E2%80%99s-not",
        "thread_title": "Apple is tracking you even when its own privacy settings say it’s not",
        "post_id": "post_362938",
        "username": "RodneyYouPlonker",
        "timestamp": "Nov 09, 2022, 15:43 pm",
        "content": "Yes, that's totally true. Apple is watching you I know all about it. I noticed with the anti telemetry company that I use that quite some time ago they introduced lots of Apple servers to block. Thankfully I have all those blocked regardless of whether I'm using an Apple product (which I'm not) but I have all the list of servers that are used around the world and I know exactly what their game is. Certainly if you use Apple and you're a Pirate of the internet then chances are they know all sorts about you.",
        "tokens": [
            "yes",
            "totally",
            "true",
            "apple",
            "watching",
            "know",
            "noticed",
            "anti",
            "telemetry",
            "company",
            "use",
            "quite",
            "time",
            "ago",
            "introduced",
            "lots",
            "apple",
            "servers",
            "block",
            "thankfully",
            "blocked",
            "regardless",
            "whether",
            "using",
            "apple",
            "product",
            "list",
            "servers",
            "used",
            "around",
            "world",
            "know",
            "exactly",
            "game",
            "certainly",
            "use",
            "apple",
            "pirate",
            "internet",
            "chances",
            "know",
            "sorts"
        ],
        "scrape_time": "2025-05-09T20:16:22.925191"
    },
    {
        "source": "darkweb",
        "forum": "SuprBay",
        "thread_url": "http://suprbaydvdcaynfo4dgdzgxb4zuso7rftlil5yg5kqjefnw4wq4ulcad.onion/Thread-Apple-is-tracking-you-even-when-its-own-privacy-settings-say-it%E2%80%99s-not",
        "thread_title": "Apple is tracking you even when its own privacy settings say it’s not",
        "post_id": "post_meta_362938",
        "username": "Anonymous",
        "timestamp": "Unknown",
        "content": "",
        "tokens": [],
        "scrape_time": "2025-05-09T20:16:22.925494"
    },
    {
        "source": "darkweb",
        "forum": "SuprBay",
        "thread_url": "http://suprbaydvdcaynfo4dgdzgxb4zuso7rftlil5yg5kqjefnw4wq4ulcad.onion/Thread-Apple-is-tracking-you-even-when-its-own-privacy-settings-say-it%E2%80%99s-not",
        "thread_title": "Apple is tracking you even when its own privacy settings say it’s not",
        "post_id": "post_362942",
        "username": "CaptButler",
        "timestamp": "Nov 09, 2022, 17:55 pm",
        "content": "An old story dating back to the original version of the iPhone in 2007. Probably was invented to be a more effective data vacuum in the first place, because that's where the money was/is. And Jobs was always about the money--well, that and his personality cult.",
        "tokens": [
            "old",
            "story",
            "dating",
            "back",
            "original",
            "version",
            "iphone",
            "probably",
            "invented",
            "effective",
            "data",
            "vacuum",
            "first",
            "place",
            "money",
            "jobs",
            "always",
            "money",
            "well",
            "personality",
            "cult"
        ],
        "scrape_time": "2025-05-09T20:16:22.926856"
    },
    {
        "source": "darkweb",
        "forum": "SuprBay",
        "thread_url": "http://suprbaydvdcaynfo4dgdzgxb4zuso7rftlil5yg5kqjefnw4wq4ulcad.onion/Thread-Apple-is-tracking-you-even-when-its-own-privacy-settings-say-it%E2%80%99s-not",
        "thread_title": "Apple is tracking you even when its own privacy settings say it’s not",
        "post_id": "post_meta_362942",
        "username": "Anonymous",
        "timestamp": "Unknown",
        "content": "",
        "tokens": [],
        "scrape_time": "2025-05-09T20:16:22.927157"
    },
    {
        "source": "darkweb",
        "forum": "SuprBay",
        "thread_url": "http://suprbaydvdcaynfo4dgdzgxb4zuso7rftlil5yg5kqjefnw4wq4ulcad.onion/Thread-Apple-is-tracking-you-even-when-its-own-privacy-settings-say-it%E2%80%99s-not",
        "thread_title": "Apple is tracking you even when its own privacy settings say it’s not",
        "post_id": "post_379710",
        "username": "CaptButler",
        "timestamp": "Sep 21, 2023, 09:41 am",
        "content": "(Sep 21, 2023, 03:23 am) delwycharm Wrote: Although Apple is allegedly committed to protecting user privacy and providing settings to control information collection, research has shown that information is still collected and shared . to a limited extent. surprising detail. incredibox FTFY",
        "tokens": [
            "sep",
            "21",
            "2023",
            "delwycharm",
            "wrote",
            "although",
            "apple",
            "allegedly",
            "committed",
            "protecting",
            "user",
            "privacy",
            "providing",
            "settings",
            "control",
            "information",
            "collection",
            "research",
            "shown",
            "information",
            "still",
            "collected",
            "shared",
            "limited",
            "extent",
            "surprising",
            "detail",
            "incredibox",
            "ftfy"
        ],
        "scrape_time": "2025-05-09T20:16:22.928871"
    },
    {
        "source": "darkweb",
        "forum": "SuprBay",
        "thread_url": "http://suprbaydvdcaynfo4dgdzgxb4zuso7rftlil5yg5kqjefnw4wq4ulcad.onion/Thread-Apple-is-tracking-you-even-when-its-own-privacy-settings-say-it%E2%80%99s-not",
        "thread_title": "Apple is tracking you even when its own privacy settings say it’s not",
        "post_id": "post_meta_379710",
        "username": "Anonymous",
        "timestamp": "Unknown",
        "content": "",
        "tokens": [],
        "scrape_time": "2025-05-09T20:16:22.929188"
    },
    {
        "source": "darkweb",
        "forum": "SuprBay",
        "thread_url": "http://suprbaydvdcaynfo4dgdzgxb4zuso7rftlil5yg5kqjefnw4wq4ulcad.onion/Thread-Apple-is-tracking-you-even-when-its-own-privacy-settings-say-it%E2%80%99s-not",
        "thread_title": "Apple is tracking you even when its own privacy settings say it’s not",
        "post_id": "post_383584",
        "username": "lustrous",
        "timestamp": "Nov 11, 2023, 06:54 am (This post was last modified: Nov 11, 2023, 06:55 am by lustrous. Edited 1 time in total. Edit Reason: GNU/Linux Distro Links )",
        "content": "Man It's high time we break away from big tech's stronghold and consider alternatives like GNU/Linux ( Debian , Arch , Fedora ) for our desktops and GrapheneOS for smartphones to protect our digital freedom. In cases where GrapheneOS isn't accessible, DivestOS comes second as a commendable solution, serving as a harm reduction project for EOL devices.",
        "tokens": [
            "man",
            "high",
            "time",
            "break",
            "away",
            "big",
            "tech",
            "stronghold",
            "consider",
            "alternatives",
            "like",
            "debian",
            "arch",
            "fedora",
            "desktops",
            "grapheneos",
            "smartphones",
            "protect",
            "digital",
            "freedom",
            "cases",
            "grapheneos",
            "accessible",
            "divestos",
            "comes",
            "second",
            "commendable",
            "solution",
            "serving",
            "harm",
            "reduction",
            "project",
            "eol",
            "devices"
        ],
        "scrape_time": "2025-05-09T20:16:22.930885"
    },
    {
        "source": "darkweb",
        "forum": "SuprBay",
        "thread_url": "http://suprbaydvdcaynfo4dgdzgxb4zuso7rftlil5yg5kqjefnw4wq4ulcad.onion/Thread-Apple-is-tracking-you-even-when-its-own-privacy-settings-say-it%E2%80%99s-not",
        "thread_title": "Apple is tracking you even when its own privacy settings say it’s not",
        "post_id": "post_meta_383584",
        "username": "Anonymous",
        "timestamp": "Unknown",
        "content": "",
        "tokens": [],
        "scrape_time": "2025-05-09T20:16:22.931145"
    },
    {
        "source": "darkweb",
        "forum": "SuprBay",
        "thread_url": "http://suprbaydvdcaynfo4dgdzgxb4zuso7rftlil5yg5kqjefnw4wq4ulcad.onion/Thread-Apple-is-tracking-you-even-when-its-own-privacy-settings-say-it%E2%80%99s-not",
        "thread_title": "Apple is tracking you even when its own privacy settings say it’s not",
        "post_id": "post_362937",
        "username": "Resurgence",
        "timestamp": "Nov 09, 2022, 14:58 pm",
        "content": "Written by Thomas Germain Published: November 9, 2022 For all of Apple’s talk about how private your iPhone is, the company vacuums up a lot of data about you. iPhones do have a privacy setting that is supposed to turn off that tracking. According to a new report by independent researchers, though, Apple collects extremely detailed information on you with its own apps even when you turn off tracking, an apparent direct contradiction of Apple’s own description of how the privacy protection works. The iPhone Analytics setting makes an explicit promise. Turn it off, and Apple says that it will “disable the sharing of Device Analytics altogether.” However, Tommy Mysk and Talal Haj Bakry, two app developers and security researchers at the software company Mysk, took a look at the data collected by a number of Apple iPhone apps—the App Store, Apple Music, Apple TV, Books, and Stocks. They found the analytics control and other privacy settings had no obvious effect on Apple’s data collection—the tracking remained the same whether iPhone Analytics was switched on or off. “The level of detail is shocking for a company like Apple,” Mysk told Gizmodo. The App Store appeared to harvest information about every single thing you did in real time, including what you tapped on, which apps you search for, what ads you saw, and how long you looked at a given app and how you found it. The app sent details about you and your device as well, including ID numbers, what kind of phone you’re using, your screen resolution, your keyboard languages, how you’re connected to the internet—notably, the kind of information commonly used for device fingerprinting. “Opting-out or switching the personalization options off did not reduce the amount of detailed analytics that the app was sending,” Mysk said. “I switched all the possible options off, namely personalized ads, personalized recommendations, and sharing usage data and analytics.” Apple did not respond to multiple requests for comment. Gizmodo requested that Mysk examine a few other Apple apps for comparison. The researchers said that the Health and Wallet apps, for example, didn’t transmit any analytics data at all, regardless of whether the iPhone Analytics setting was on or off, whereas Apple Music, Apple TV, Books, the iTunes Store, and Stocks all did. Most of the apps that sent analytics data shared consistent ID numbers, which would allow Apple to track your activity across its services, the researchers found. For example, the Stocks app sent Apple your list of watched stocks, the names stocks you viewed or searched for and time stamps for when you did it, as well as a record of any news articles you see in the app, according to Mysk’s analysis for Gizmodo. The information was sent to a web address labeled analytics, . That transmission was separate from the iCloud communication necessary to sync your data across devices. Unlike the other apps, however, Stocks sent different ID numbers and far less detailed device information. The researchers checked their work on two different devices. First, they used a jail broken iPhone running iOS 14.6, which allowed them to decrypt the traffic and examine exactly what data was being sent. Apple introduced App Tracking Transparency in iOS 14.5, cuing users to decide whether or not to give their data to individual apps with the prompt “Ask app not to track?” The researchers also examined a regular iPhone running iOS 16, the latest operating system, which bolstered their findings. There is little reason to think that the jail broken phone would send different data, they said, but On iOS 16, they saw the same apps sending similar packets of data to the same Apple web addresses. The data was transmitted at the same times under the same circumstances, and turning the available privacy settings on and off likewise didn’t change anything. The researchers couldn’t examine exactly what data was sent because the phone’s encryption remained intact, but the similarities suggest this may be standard behavior on the iPhone. It’s impossible to know what Apple is doing with the data without the company’s own explanation, and as is so often the case, Apple has been silent so far. It’s entirely possible that Apple doesn’t use the information if you turn the settings off, but that’s not how the company explains what the settings do in its privacy policy. This isn’t an every-app-is-tracking-me-so-what’s-one-more situation. These findings are out of line with standard industry practices, Mysk says. He and his research partner ran similar tests in the past looking at analytics in Google Chrome and Microsoft Edge. In both of those apps, Mysk says the data isn’t sent when analytics settings are turned off. Privacy is one of the main issues that Apple uses to set its products apart from competitors. It emblazoned 40-foot billboards of the iPhone with the simple slogan “Privacy. That’s iPhone.” and ran the ads across the world for months. But the company is slowly introducing many of the internet’s privacy issues into the once sacrosanct Apple ecosystem. Apple is working hard to build an advertising empire. Apple’s ad network runs on your personal information just like the ones Google and Meta operate, albeit in a more reserved way. Along the way, Apple developed a very convenient definition of what privacy means that lets the company criticize its rivals’ privacy practices while harvesting your data for similar purposes. Apple says you shouldn’t think of what it does as “tracking.” According to the company’s website: Quote: Apple’s advertising platform does not track you, meaning that it does not link user or device data collected from our apps with user or device data collected from third parties for targeted advertising or advertising measurement purposes, and does not share user or device data with data brokers. In other words, it’s not tracking unless you’re linking together data collected from services owned by different companies. If only one company—Apple—is collecting the data, then by Apple’s definition, it’s not tracking. Of course, that’s different from the definition of tracking that everyone else seems to use. It’s no surprise that Apple is collecting analytics information, the practice is laid out in the privacy policy, and almost every app and device you use probably uses your data for analytics. But Mysk said he’s stunned at the level of detail. “I expected from a company like Apple, that believes that privacy is a fundamental human right, to collect more generic analytics,” Mysk said. What happens on your iPhone stays on your iPhone, unless you count the mountains of information your iPhone sends to Apple.",
        "tokens": [
            "written",
            "thomas",
            "germain",
            "published",
            "november",
            "9",
            "2022",
            "apple",
            "talk",
            "private",
            "iphone",
            "company",
            "vacuums",
            "lot",
            "data",
            "iphones",
            "privacy",
            "setting",
            "supposed",
            "turn",
            "tracking",
            "according",
            "new",
            "report",
            "independent",
            "researchers",
            "though",
            "apple",
            "collects",
            "extremely",
            "detailed",
            "information",
            "apps",
            "even",
            "turn",
            "tracking",
            "apparent",
            "direct",
            "contradiction",
            "apple",
            "description",
            "privacy",
            "protection",
            "works",
            "iphone",
            "analytics",
            "setting",
            "makes",
            "explicit",
            "promise",
            "turn",
            "apple",
            "says",
            "disable",
            "sharing",
            "device",
            "analytics",
            "however",
            "tommy",
            "mysk",
            "talal",
            "haj",
            "bakry",
            "two",
            "app",
            "developers",
            "security",
            "researchers",
            "software",
            "company",
            "mysk",
            "took",
            "look",
            "data",
            "collected",
            "number",
            "apple",
            "iphone",
            "app",
            "store",
            "apple",
            "music",
            "apple",
            "tv",
            "books",
            "stocks",
            "found",
            "analytics",
            "control",
            "privacy",
            "settings",
            "obvious",
            "effect",
            "apple",
            "data",
            "tracking",
            "remained",
            "whether",
            "iphone",
            "analytics",
            "switched",
            "level",
            "detail",
            "shocking",
            "company",
            "like",
            "apple",
            "mysk",
            "told",
            "gizmodo",
            "app",
            "store",
            "appeared",
            "harvest",
            "information",
            "every",
            "single",
            "thing",
            "real",
            "time",
            "including",
            "tapped",
            "apps",
            "search",
            "ads",
            "saw",
            "long",
            "looked",
            "given",
            "app",
            "found",
            "app",
            "sent",
            "details",
            "device",
            "well",
            "including",
            "id",
            "numbers",
            "kind",
            "phone",
            "using",
            "screen",
            "resolution",
            "keyboard",
            "languages",
            "connected",
            "kind",
            "information",
            "commonly",
            "used",
            "device",
            "fingerprinting",
            "switching",
            "personalization",
            "options",
            "reduce",
            "amount",
            "detailed",
            "analytics",
            "app",
            "sending",
            "mysk",
            "said",
            "switched",
            "possible",
            "options",
            "namely",
            "personalized",
            "ads",
            "personalized",
            "recommendations",
            "sharing",
            "usage",
            "data",
            "apple",
            "respond",
            "multiple",
            "requests",
            "comment",
            "gizmodo",
            "requested",
            "mysk",
            "examine",
            "apple",
            "apps",
            "comparison",
            "researchers",
            "said",
            "health",
            "wallet",
            "apps",
            "example",
            "transmit",
            "analytics",
            "data",
            "regardless",
            "whether",
            "iphone",
            "analytics",
            "setting",
            "whereas",
            "apple",
            "music",
            "apple",
            "tv",
            "books",
            "itunes",
            "store",
            "stocks",
            "apps",
            "sent",
            "analytics",
            "data",
            "shared",
            "consistent",
            "id",
            "numbers",
            "would",
            "allow",
            "apple",
            "track",
            "activity",
            "across",
            "services",
            "researchers",
            "found",
            "example",
            "stocks",
            "app",
            "sent",
            "apple",
            "list",
            "watched",
            "stocks",
            "names",
            "stocks",
            "viewed",
            "searched",
            "time",
            "stamps",
            "well",
            "record",
            "news",
            "articles",
            "see",
            "app",
            "according",
            "mysk",
            "analysis",
            "gizmodo",
            "information",
            "sent",
            "web",
            "address",
            "labeled",
            "analytics",
            "transmission",
            "separate",
            "icloud",
            "communication",
            "necessary",
            "sync",
            "data",
            "across",
            "devices",
            "unlike",
            "apps",
            "however",
            "stocks",
            "sent",
            "different",
            "id",
            "numbers",
            "far",
            "less",
            "detailed",
            "device",
            "information",
            "researchers",
            "checked",
            "work",
            "two",
            "different",
            "devices",
            "first",
            "used",
            "jail",
            "broken",
            "iphone",
            "running",
            "ios",
            "allowed",
            "decrypt",
            "traffic",
            "examine",
            "exactly",
            "data",
            "sent",
            "apple",
            "introduced",
            "app",
            "tracking",
            "transparency",
            "ios",
            "cuing",
            "users",
            "decide",
            "whether",
            "give",
            "data",
            "individual",
            "apps",
            "prompt",
            "ask",
            "app",
            "track",
            "researchers",
            "also",
            "examined",
            "regular",
            "iphone",
            "running",
            "ios",
            "16",
            "latest",
            "operating",
            "system",
            "bolstered",
            "findings",
            "little",
            "reason",
            "think",
            "jail",
            "broken",
            "phone",
            "would",
            "send",
            "different",
            "data",
            "said",
            "ios",
            "16",
            "saw",
            "apps",
            "sending",
            "similar",
            "packets",
            "data",
            "apple",
            "web",
            "addresses",
            "data",
            "transmitted",
            "times",
            "circumstances",
            "turning",
            "available",
            "privacy",
            "settings",
            "likewise",
            "change",
            "anything",
            "researchers",
            "examine",
            "exactly",
            "data",
            "sent",
            "phone",
            "encryption",
            "remained",
            "intact",
            "similarities",
            "suggest",
            "may",
            "standard",
            "behavior",
            "iphone",
            "impossible",
            "know",
            "apple",
            "data",
            "without",
            "company",
            "explanation",
            "often",
            "case",
            "apple",
            "silent",
            "far",
            "entirely",
            "possible",
            "apple",
            "use",
            "information",
            "turn",
            "settings",
            "company",
            "explains",
            "settings",
            "privacy",
            "policy",
            "situation",
            "findings",
            "line",
            "standard",
            "industry",
            "practices",
            "mysk",
            "says",
            "research",
            "partner",
            "ran",
            "similar",
            "tests",
            "past",
            "looking",
            "analytics",
            "google",
            "chrome",
            "microsoft",
            "edge",
            "apps",
            "mysk",
            "says",
            "data",
            "sent",
            "analytics",
            "settings",
            "turned",
            "privacy",
            "one",
            "main",
            "issues",
            "apple",
            "uses",
            "set",
            "products",
            "apart",
            "competitors",
            "emblazoned",
            "billboards",
            "iphone",
            "simple",
            "slogan",
            "privacy",
            "ran",
            "ads",
            "across",
            "world",
            "months",
            "company",
            "slowly",
            "introducing",
            "many",
            "internet",
            "privacy",
            "issues",
            "sacrosanct",
            "apple",
            "ecosystem",
            "apple",
            "working",
            "hard",
            "build",
            "advertising",
            "empire",
            "apple",
            "ad",
            "network",
            "runs",
            "personal",
            "information",
            "like",
            "ones",
            "google",
            "meta",
            "operate",
            "albeit",
            "reserved",
            "way",
            "along",
            "way",
            "apple",
            "developed",
            "convenient",
            "definition",
            "privacy",
            "means",
            "lets",
            "company",
            "criticize",
            "rivals",
            "privacy",
            "practices",
            "harvesting",
            "data",
            "similar",
            "purposes",
            "apple",
            "says",
            "think",
            "according",
            "company",
            "website",
            "quote",
            "apple",
            "advertising",
            "platform",
            "track",
            "meaning",
            "link",
            "user",
            "device",
            "data",
            "collected",
            "apps",
            "user",
            "device",
            "data",
            "collected",
            "third",
            "parties",
            "targeted",
            "advertising",
            "advertising",
            "measurement",
            "purposes",
            "share",
            "user",
            "device",
            "data",
            "data",
            "brokers",
            "words",
            "tracking",
            "unless",
            "linking",
            "together",
            "data",
            "collected",
            "services",
            "owned",
            "different",
            "companies",
            "one",
            "collecting",
            "data",
            "apple",
            "definition",
            "tracking",
            "course",
            "different",
            "definition",
            "tracking",
            "everyone",
            "else",
            "seems",
            "use",
            "surprise",
            "apple",
            "collecting",
            "analytics",
            "information",
            "practice",
            "laid",
            "privacy",
            "policy",
            "almost",
            "every",
            "app",
            "device",
            "use",
            "probably",
            "uses",
            "data",
            "analytics",
            "mysk",
            "said",
            "stunned",
            "level",
            "detail",
            "expected",
            "company",
            "like",
            "apple",
            "believes",
            "privacy",
            "fundamental",
            "human",
            "right",
            "collect",
            "generic",
            "analytics",
            "mysk",
            "said",
            "happens",
            "iphone",
            "stays",
            "iphone",
            "unless",
            "count",
            "mountains",
            "information",
            "iphone",
            "sends",
            "apple"
        ],
        "scrape_time": "2025-05-09T20:16:33.041060"
    },
    {
        "source": "darkweb",
        "forum": "SuprBay",
        "thread_url": "http://suprbaydvdcaynfo4dgdzgxb4zuso7rftlil5yg5kqjefnw4wq4ulcad.onion/Thread-Apple-is-tracking-you-even-when-its-own-privacy-settings-say-it%E2%80%99s-not",
        "thread_title": "Apple is tracking you even when its own privacy settings say it’s not",
        "post_id": "post_meta_362937",
        "username": "Anonymous",
        "timestamp": "Unknown",
        "content": "",
        "tokens": [],
        "scrape_time": "2025-05-09T20:16:33.041402"
    },
    {
        "source": "darkweb",
        "forum": "SuprBay",
        "thread_url": "http://suprbaydvdcaynfo4dgdzgxb4zuso7rftlil5yg5kqjefnw4wq4ulcad.onion/Thread-Apple-is-tracking-you-even-when-its-own-privacy-settings-say-it%E2%80%99s-not",
        "thread_title": "Apple is tracking you even when its own privacy settings say it’s not",
        "post_id": "post_362938",
        "username": "RodneyYouPlonker",
        "timestamp": "Nov 09, 2022, 15:43 pm",
        "content": "Yes, that's totally true. Apple is watching you I know all about it. I noticed with the anti telemetry company that I use that quite some time ago they introduced lots of Apple servers to block. Thankfully I have all those blocked regardless of whether I'm using an Apple product (which I'm not) but I have all the list of servers that are used around the world and I know exactly what their game is. Certainly if you use Apple and you're a Pirate of the internet then chances are they know all sorts about you.",
        "tokens": [
            "yes",
            "totally",
            "true",
            "apple",
            "watching",
            "know",
            "noticed",
            "anti",
            "telemetry",
            "company",
            "use",
            "quite",
            "time",
            "ago",
            "introduced",
            "lots",
            "apple",
            "servers",
            "block",
            "thankfully",
            "blocked",
            "regardless",
            "whether",
            "using",
            "apple",
            "product",
            "list",
            "servers",
            "used",
            "around",
            "world",
            "know",
            "exactly",
            "game",
            "certainly",
            "use",
            "apple",
            "pirate",
            "internet",
            "chances",
            "know",
            "sorts"
        ],
        "scrape_time": "2025-05-09T20:16:33.042930"
    },
    {
        "source": "darkweb",
        "forum": "SuprBay",
        "thread_url": "http://suprbaydvdcaynfo4dgdzgxb4zuso7rftlil5yg5kqjefnw4wq4ulcad.onion/Thread-Apple-is-tracking-you-even-when-its-own-privacy-settings-say-it%E2%80%99s-not",
        "thread_title": "Apple is tracking you even when its own privacy settings say it’s not",
        "post_id": "post_meta_362938",
        "username": "Anonymous",
        "timestamp": "Unknown",
        "content": "",
        "tokens": [],
        "scrape_time": "2025-05-09T20:16:33.043229"
    },
    {
        "source": "darkweb",
        "forum": "SuprBay",
        "thread_url": "http://suprbaydvdcaynfo4dgdzgxb4zuso7rftlil5yg5kqjefnw4wq4ulcad.onion/Thread-Apple-is-tracking-you-even-when-its-own-privacy-settings-say-it%E2%80%99s-not",
        "thread_title": "Apple is tracking you even when its own privacy settings say it’s not",
        "post_id": "post_362942",
        "username": "CaptButler",
        "timestamp": "Nov 09, 2022, 17:55 pm",
        "content": "An old story dating back to the original version of the iPhone in 2007. Probably was invented to be a more effective data vacuum in the first place, because that's where the money was/is. And Jobs was always about the money--well, that and his personality cult.",
        "tokens": [
            "old",
            "story",
            "dating",
            "back",
            "original",
            "version",
            "iphone",
            "probably",
            "invented",
            "effective",
            "data",
            "vacuum",
            "first",
            "place",
            "money",
            "jobs",
            "always",
            "money",
            "well",
            "personality",
            "cult"
        ],
        "scrape_time": "2025-05-09T20:16:33.044555"
    },
    {
        "source": "darkweb",
        "forum": "SuprBay",
        "thread_url": "http://suprbaydvdcaynfo4dgdzgxb4zuso7rftlil5yg5kqjefnw4wq4ulcad.onion/Thread-Apple-is-tracking-you-even-when-its-own-privacy-settings-say-it%E2%80%99s-not",
        "thread_title": "Apple is tracking you even when its own privacy settings say it’s not",
        "post_id": "post_meta_362942",
        "username": "Anonymous",
        "timestamp": "Unknown",
        "content": "",
        "tokens": [],
        "scrape_time": "2025-05-09T20:16:33.044850"
    },
    {
        "source": "darkweb",
        "forum": "SuprBay",
        "thread_url": "http://suprbaydvdcaynfo4dgdzgxb4zuso7rftlil5yg5kqjefnw4wq4ulcad.onion/Thread-Apple-is-tracking-you-even-when-its-own-privacy-settings-say-it%E2%80%99s-not",
        "thread_title": "Apple is tracking you even when its own privacy settings say it’s not",
        "post_id": "post_379710",
        "username": "CaptButler",
        "timestamp": "Sep 21, 2023, 09:41 am",
        "content": "(Sep 21, 2023, 03:23 am) delwycharm Wrote: Although Apple is allegedly committed to protecting user privacy and providing settings to control information collection, research has shown that information is still collected and shared . to a limited extent. surprising detail. incredibox FTFY",
        "tokens": [
            "sep",
            "21",
            "2023",
            "delwycharm",
            "wrote",
            "although",
            "apple",
            "allegedly",
            "committed",
            "protecting",
            "user",
            "privacy",
            "providing",
            "settings",
            "control",
            "information",
            "collection",
            "research",
            "shown",
            "information",
            "still",
            "collected",
            "shared",
            "limited",
            "extent",
            "surprising",
            "detail",
            "incredibox",
            "ftfy"
        ],
        "scrape_time": "2025-05-09T20:16:33.046424"
    },
    {
        "source": "darkweb",
        "forum": "SuprBay",
        "thread_url": "http://suprbaydvdcaynfo4dgdzgxb4zuso7rftlil5yg5kqjefnw4wq4ulcad.onion/Thread-Apple-is-tracking-you-even-when-its-own-privacy-settings-say-it%E2%80%99s-not",
        "thread_title": "Apple is tracking you even when its own privacy settings say it’s not",
        "post_id": "post_meta_379710",
        "username": "Anonymous",
        "timestamp": "Unknown",
        "content": "",
        "tokens": [],
        "scrape_time": "2025-05-09T20:16:33.046698"
    },
    {
        "source": "darkweb",
        "forum": "SuprBay",
        "thread_url": "http://suprbaydvdcaynfo4dgdzgxb4zuso7rftlil5yg5kqjefnw4wq4ulcad.onion/Thread-Apple-is-tracking-you-even-when-its-own-privacy-settings-say-it%E2%80%99s-not",
        "thread_title": "Apple is tracking you even when its own privacy settings say it’s not",
        "post_id": "post_383584",
        "username": "lustrous",
        "timestamp": "Nov 11, 2023, 06:54 am (This post was last modified: Nov 11, 2023, 06:55 am by lustrous. Edited 1 time in total. Edit Reason: GNU/Linux Distro Links )",
        "content": "Man It's high time we break away from big tech's stronghold and consider alternatives like GNU/Linux ( Debian , Arch , Fedora ) for our desktops and GrapheneOS for smartphones to protect our digital freedom. In cases where GrapheneOS isn't accessible, DivestOS comes second as a commendable solution, serving as a harm reduction project for EOL devices.",
        "tokens": [
            "man",
            "high",
            "time",
            "break",
            "away",
            "big",
            "tech",
            "stronghold",
            "consider",
            "alternatives",
            "like",
            "debian",
            "arch",
            "fedora",
            "desktops",
            "grapheneos",
            "smartphones",
            "protect",
            "digital",
            "freedom",
            "cases",
            "grapheneos",
            "accessible",
            "divestos",
            "comes",
            "second",
            "commendable",
            "solution",
            "serving",
            "harm",
            "reduction",
            "project",
            "eol",
            "devices"
        ],
        "scrape_time": "2025-05-09T20:16:33.048282"
    },
    {
        "source": "darkweb",
        "forum": "SuprBay",
        "thread_url": "http://suprbaydvdcaynfo4dgdzgxb4zuso7rftlil5yg5kqjefnw4wq4ulcad.onion/Thread-Apple-is-tracking-you-even-when-its-own-privacy-settings-say-it%E2%80%99s-not",
        "thread_title": "Apple is tracking you even when its own privacy settings say it’s not",
        "post_id": "post_meta_383584",
        "username": "Anonymous",
        "timestamp": "Unknown",
        "content": "",
        "tokens": [],
        "scrape_time": "2025-05-09T20:16:33.048578"
    }
]